RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_nvmc.c
/*!
    \file    gd32h77x_78x_nvmc.c
    \brief   NVMC driver

    \version 2026-06-18, V0.5.0, firmware for GD32H77x_78x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32h77x_78x_nvmc.h"

#if (defined(GD32H77X_78X_XW))
#define NVM_VER_2_AND_7_5
#elif (defined(GD32H77X_78X_XP))
#define NVM_VER_2_AND_3_5
#elif (defined(GD32H77X_78X_XI))
#define NVM_VER_1_625_AND_0
#endif

/* NVMC register bit offset */
#define BTADDR_BOOT_ADDR0_OFFSET                    ((uint32_t)0x00000000U)       /*!< bit offset of BOOT_ADDR0 in NVMC_BTADDR_EFT/NVMC_BTADDR_MDF */
#define BTADDR_BOOT_ADDR1_OFFSET                    ((uint32_t)0x00000010U)       /*!< bit offset of BOOT_ADDR1 in NVMC_BTADDR_EFT/NVMC_BTADDR_MDF */
#define SCRADDR_SCR_AREA_START_OFFSET               ((uint32_t)0x00000000U)       /*!< bit offset of SCR_AREA_START in NVMC_SCRADDR_EFT/NVMC_SCRADDR_MDF */
#define SCRADDR_SCR_AREA_END_OFFSET                 ((uint32_t)0x00000010U)       /*!< bit offset of SCR_AREA_END in NVMC_SCRADDR_EFT/NVMC_SCRADDR_MDF */
#define DCRPADDR_DCRP_AREA_START_OFFSET             ((uint32_t)0x00000000U)       /*!< bit offset of DCRP_AREA_START in NVMC_DCRPADDR_EFT/NVMC_DCRPADDR_MDF */
#define DCRPADDR_DCRP_AREA_END_OFFSET               ((uint32_t)0x00000010U)       /*!< bit offset of DCRP_AREA_END in NVMC_DCRPADDR_EFT/NVMC_DCRPADDR_MDF */
#define OBSTAT0_SPC_OFFSET                          ((uint32_t)0x00000008U)       /*!< bit offset of SPC in NVMC_OBSTAT0_EFT/NVMC_OBSTAT0_MDF */
#define OBSTAT1_DATA_OFFSET                         ((uint32_t)0x00000010U)       /*!< bit offset of DATA in NVMC_OBSTAT1_EFT/NVMC_OBSTAT1_MDF */
#define OBREPSTADDR_STARTADDR_OFFSET                ((uint32_t)0x00000005U)       /*!< bit offset of STARTADDR in NVMC_OBREPSTADDR_EFT_STARTADDR/NVMC_OBREPSTADDR_MDF_STARTADDR */
#define OBREPSTADDR_ENDADDR_OFFSET                  ((uint32_t)0x00000005U)       /*!< bit offset of ENDADDR in NVMC_OBREPSTADDR_EFT_STARTADDR/NVMC_OBREPSTADDR_MDF_STARTADDR */
#define OBBBADDRX_OBBBADDRVLD_OFFSET                ((uint32_t)0x00000000U)       /*!< bit offset of OBBBADDRVLD in NVMC_OBBBADDRX_EFT/NVMC_OBBBADDRX_MDF */
#define OBBBADDRX_OBBBADDR_OFFSET                   ((uint32_t)0x00000005U)       /*!< bit offset of OBBBADDR in NVMC_OBBBADDRX_EFT/NVMC_OBBBADDRX_MDF */
#define OBREPCTL_UPDATESZ_OFFSET                    ((uint32_t)0x0000001AU)       /*!< bit offset of UPDATESZ in NVMC_OBREPCTL_EFT/NVMC_OBREPCTL_MDF */
#define OBREPCTL_DIESZ_OFFSET                       ((uint32_t)0x00000008U)       /*!< bit offset of DIESZ in NVMC_OBREPCTL_EFT/NVMC_OBREPCTL_MDF */

#define ROBBADDRX_ROBBADDRSTAT_OFFSET               ((uint32_t)0x00000000U)       /*!< bit offset of ROBBADDRSTAT in NVMC_CNVM_ROBBADDRX */
#define ROBBADDRX_ROBBADDR_OFFSET                   ((uint32_t)0x00000005U)       /*!< bit offset of ROBBADDR in NVMC_CNVM_ROBBADDRX */
#define AUTOERR2ADDRX_AUTOERR2ADDRSTAT_OFFSET       ((uint32_t)0x00000000U)       /*!< bit offset of AUTOERR2ADDRSTAT in NVMC_CNVM_AUTOERR2ADDRX */
#define AUTOERR2ADDRX_AUTOERR2ADDR_OFFSET           ((uint32_t)0x00000005U)       /*!< bit offset of AUTOERR2ADDR in NVMC_CNVM_AUTOERR2ADDRX */

#define CNVM_REPCS_ROBBCNT_OFFSET                   ((uint32_t)0x00000010U)       /*!< bit offset of ROBBCNT in NVMC_CNVM_REPCS */
#define CNVM_REPCS_REPERRSTAT_OFFSET                ((uint32_t)0x00000008U)       /*!< bit offset of REPERRSTAT in NVMC_CNVM_REPCS */

#define WP1_ECNVM_OFFSET                            ((uint32_t)0x00000020U)       /*!< bit offset of WP1_ECNVM in OB_ECNVM_WP_ALL */

/* option byte factory value */
#define OB_OBSTAT0_FACTORY_VALUE                    ((uint32_t)0x5FC6AAD0U)       /*!< the factory value of option byte in NVMC_OBSTAT0_EFT/NVMC_OBSTAT0_MDF */
#define OB_OBSTAT1_FACTORY_VALUE                    ((uint32_t)0xFFFF0000U)       /*!< the factory value of option byte in NVMC_OBSTAT1_EFT/NVMC_OBSTAT1_MDF */
#define OB_BTADDR_FACTORY_VALUE                     ((uint32_t)0x1FEF0800U)       /*!< the factory value of option byte in NVMC_BTADDR_EFT/NVMC_BTADDR_MDF */
#define OB_WP_CNVM_FACTORY_VALUE                    ((uint32_t)0x0000FFFFU)       /*!< the factory value of option byte in NVMC_WP_CNVM_EFT/NVMC_WP_CNVM_MDF */
#define OB_WP0_ECNVM_FACTORY_VALUE                  ((uint32_t)0xFFFFFFFFU)       /*!< the factory value of option byte in NVMC_WP0_ECNVM_EFT/NVMC_WP0_ECNVM_MDF */
#define OB_WP1_ECNVM_FACTORY_VALUE                  ((uint32_t)0x0FFFFFFFU)       /*!< the factory value of option byte in NVMC_WP1_ECNVM_EFT/NVMC_WP1_ECNVM_MDF */
#define OB_OBREPSTADDR_FACTORY_VALUE                ((uint32_t)0x08000000U)       /*!< the factory value of option byte in NVMC_OBREPSTADDR_EFT/NVMC_OBREPSTADDR_MDF */
#if defined(NVM_VER_1_625_AND_0)
#define OB_OBREPCTL_FACTORY_VALUE                   ((uint32_t)0xFE10DF00U)       /*!< the factory value of option byte in NVMC_OBREPCTL_EFT/NVMC_OBREPCTL_MDF */
#define OB_OBREPENDADDR_FACTORY_VALUE               ((uint32_t)0x08000000U)       /*!< the factory value of option byte in NVMC_OBREPENDADDR_EFT/NVMC_OBREPENDADDR_MDF */
#else
#define OB_OBREPCTL_FACTORY_VALUE                   ((uint32_t)0xFE107F3BU)       /*!< the factory value of option byte in NVMC_OBREPCTL_EFT/NVMC_OBREPCTL_MDF */
#define OB_OBREPENDADDR_FACTORY_VALUE               ((uint32_t)0x081FFFE0U)       /*!< the factory value of option byte in NVMC_OBREPENDADDR_EFT/NVMC_OBREPENDADDR_MDF */
#endif /* NVM_VER_XX */
#define OB_OBBBADDRX_FACTORY_VALUE                  ((uint32_t)0x08000000U)       /*!< the factory value of option byte in NVMC_OBBBADDRX_EFT/NVMC_OBBBADDRX_MDF */

