RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_nvmc.c
/* NVMC parameter mask */
#define DCRP_EN_MASK                                ((uint32_t)0x0000E000U)        /*!< DCRP area enable bits mask */
#define DCRP_EREN_MASK                              ((uint32_t)0xE0000000U)        /*!< DCRP area erase enable bits mask */
#define SCR_EN_MASK                                 ((uint32_t)0x0000E000U)        /*!< SCR area enable bits mask */
#define SCR_EREN_MASK                               ((uint32_t)0xE0000000U)        /*!< SCR area erase enable bits mask */
#define LOW_32BITS_MASK                             ((uint32_t)0xFFFFFFFFU)        /*!< the 0-31 bits mask of a word */

#define NVMC_DCRPADDR_MDF_DCRP_EREN_29_31 (NVMC_DCRPADDR_MDF_ECNVM_BANK1_DCRP_EREN | NVMC_DCRPADDR_MDF_ECNVM_BANK0_DCRP_EREN | NVMC_DCRPADDR_MDF_CNVM_DCRP_EREN)
#define NVMC_SCRADDR_MDF_SCR_EREN_29_31 (NVMC_SCRADDR_MDF_ECNVM_BANK1_SCR_EREN | NVMC_SCRADDR_MDF_ECNVM_BANK0_SCR_EREN | NVMC_SCRADDR_MDF_CNVM_SCR_EREN)

/* get CNVM state */
static cnvm_state_enum nvmc_cnvm_state_get(void);
/* check CNVM ready or not */
static cnvm_state_enum nvmc_cnvm_ready_wait(uint32_t timeout);
/* check CNVM ready or not */
static cnvm_state_enum _nvmc_cnvm_ready_wait(uint32_t timeout);
/* get CNVM crc state */
static cnvm_state_enum nvmc_cnvm_crc_state_get(void);
/* check CNVM crc ready or not */
static cnvm_state_enum nvmc_cnvm_crc_ready_wait(uint32_t timeout);
/* get CNVM repair state */
static cnvm_state_enum nvmc_cnvm_repair_state_get(void);
/* check CNVM repair ready or not */
static cnvm_state_enum nvmc_cnvm_repair_ready_wait(uint32_t timeout);
/* get ecnvm state */
static ecnvm_state_enum nvmc_ecnvm_state_get(void);
/* check ecnvm ready or not */
static ecnvm_state_enum nvmc_ecnvm_ready_wait(uint32_t timeout);
/* check ecnvm ready or not */
static ecnvm_state_enum _nvmc_ecnvm_ready_wait(uint32_t timeout);
/* get OTP state */
static otp_state_enum nvmc_otp_state_get(void);
/* check OTP ready or not */
static otp_state_enum nvmc_otp_ready_wait(uint32_t timeout);
/* get option byte state */
static nvmc_ob_state_enum nvmc_ob_state_get(void);
/* check option byte ready or not */
static nvmc_ob_state_enum nvmc_ob_ready_wait(uint32_t timeout);

/*!
    \brief      unlock register NVMC_CNVM_CTL (API_ID(0x0001U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_cnvm_unlock(void)
{
    if((RESET != (NVMC_CNVM_CTL & NVMC_CNVM_CTL_LK))) {
        /* write the CNVM key */
        NVMC_CNVM_KEY = UNLOCK_KEY0;
        NVMC_CNVM_KEY = UNLOCK_KEY1;
    }
}

/*!
    \brief      lock register NVMC_CNVM_CTL (API_ID(0x0002U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_cnvm_lock(void)
{
    /* set the LK bit*/
    NVMC_CNVM_CTL |= NVMC_CNVM_CTL_LK;
}

/*!
    \brief      set the CNVM wait state counter value (API_ID(0x0003U))
    \param[in]  wscnt: wait state counter value
                only one parameter can be selected which is shown as below:
      \arg        PERFCTL_WSCNT_1: 1 wait state added
      \arg        PERFCTL_WSCNT_2: 2 wait state added
      \arg        PERFCTL_WSCNT_3: 3 wait state added
      \arg        PERFCTL_WSCNT_4: 4 wait state added
      \arg        PERFCTL_WSCNT_5: 5 wait state added
      \arg        PERFCTL_WSCNT_6: 6 wait state added
      \arg        PERFCTL_WSCNT_7: 7 wait state added
      \arg        PERFCTL_WSCNT_8: 8 wait state added
      \arg        PERFCTL_WSCNT_9: 9 wait state added
      \arg        PERFCTL_WSCNT_10: 10 wait state added
      \arg        PERFCTL_WSCNT_11: 11 wait state added
      \arg        PERFCTL_WSCNT_12: 12 wait state added
      \arg        PERFCTL_WSCNT_13: 13 wait state added
      \arg        PERFCTL_WSCNT_14: 14 wait state added
      \arg        PERFCTL_WSCNT_15: 15 wait state added
    \param[out] none
    \retval     none
*/
void nvmc_cnvm_wscnt_set(uint8_t wscnt)
{
    uint32_t reg;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CNVM_PERFCTL_WSCNT(wscnt)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0003U), ERR_PARAM_INVALID);
    } else
#endif
    {
        reg = NVMC_PERFCTL;
        /* set the wait state counter value */
        reg &= ~NVMC_PERFCTL_WSCNT;
        NVMC_PERFCTL = (reg | wscnt);
    }
}

/*!
    \brief      empty CNVM buffer(general buffer and CPU buffer) (API_ID(0x0004U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_cnvm_buf_empty(void)
{
    NVMC_PERFCTL |= NVMC_PERFCTL_EMPTY_CNVM_BUF;
}

/*!
    \brief      configure ecnvm buffer (API_ID(0x0005U))
    \param[in]  buf_configure: ecnvm buffer prefetch control
                only one parameter can be selected which is shown as below:
      \arg        ECNVM_NO_PREFETCH: ecnvm no prefetch
      \arg        ECNVM_PREFETCH_1_LINE: ecnvm prefetch 1 line
      \arg        ECNVM_PREFETCH_3_LINE: ecnvm prefetch 3 line
    \param[out] none
    \retval     none
*/
void nvmc_ecnvm_buffer_configure(uint32_t buf_configure)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ECNVM_PREFETCH(buf_configure)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0005U), ERR_PARAM_INVALID);
    } else
#endif
    {
        NVMC_PERFCTL &= ~NVMC_PERFCTL_ECNVM_BUF_PFETCH;
        NVMC_PERFCTL |= buf_configure;
    }
}

/*!
    \brief      configure CNVM general buffer size (API_ID(0x0006U))
    \param[in]  size: general buffer size
                only one parameter can be selected which is shown as below:
      \arg        CNVM_GP_BUF_SIZE1: CNVM general buffer size is 1x32 bytes
      \arg        CNVM_GP_BUF_SIZE2: CNVM general buffer size is 2x32 bytes
      \arg        CNVM_GP_BUF_SIZE4: CNVM general buffer size is 4x32 bytes
      \arg        CNVM_GP_BUF_SIZE8: CNVM general buffer size is 8x32 bytes
    \param[out] none
    \retval     none
*/
void nvmc_cnvm_gp_buffer_configure(uint32_t size)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CNVM_GP_BUF_SIZE(size)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0006U), ERR_PARAM_INVALID);
    } else
#endif
    {
        NVMC_PERFCTL &= ~NVMC_PERFCTL_CNVM_GP_BUFSZ;
        NVMC_PERFCTL |= size;
    }
}

/*!
    \brief      configure CNVM CPU buffer size (API_ID(0x0007U))
    \param[in]  size: CPU buffer size
                only one parameter can be selected which is shown as below:
      \arg        CNVM_CPU_BUF_SIZE1: CNVM CPU buffer size is 1x32 bytes
      \arg        CNVM_CPU_BUF_SIZE2: CNVM CPU buffer size is 2x32 bytes
      \arg        CNVM_CPU_BUF_SIZE4: CNVM CPU buffer size is 4x32 bytes
      \arg        CNVM_CPU_BUF_SIZE8: CNVM CPU buffer size is 8x32 bytes
    \param[out] none
    \retval     none
*/
void nvmc_cnvm_cpu_buffer_configure(uint32_t size)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CNVM_CPU_BUF_SIZE(size)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0007U), ERR_PARAM_INVALID);
    } else
#endif
    {
        NVMC_PERFCTL &= ~NVMC_PERFCTL_CNVM_CPU_BUFSZ;
        NVMC_PERFCTL |= size;
    }
}

/*!
    \brief      program 32 bytes at the corresponding address (API_ID(0x0008U))
    \param[in]  address: address to program, the address is in the range of CNVM block
    \param[in]  data: 32 bytes to program
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus nvmc_cnvm_32bytes_program(uint32_t address, uint64_t data[])
{
    uint32_t index;
    ErrStatus status;
    cnvm_state_enum cnvm_state = CNVM_READY;
    ecnvm_state_enum ecnvm_state = ECNVM_READY;
    uint64_t data_val;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CNVM_VALID_ADDRESS(address)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0008U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_VALID_POINTER(data)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0008U), ERR_PARAM_POINTER);
    } else
#endif
    {
        /* wait for CNVM ready */
        cnvm_state = nvmc_cnvm_ready_wait(CNVM_TIMEOUT_COUNT);

