RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_nvmc.c
        uint32_t data_integrity_enhance_area_size = nvmc_ob_data_integrity_enhance_area_size_get();
        if((nvmc_ob_data_integrity_enhance_mode_get() == SET) && ((address - CNVM_BASE_ADDRESS) < data_integrity_enhance_area_size)) {
            /* wait for ecnvm ready */
            ecnvm_state = nvmc_ecnvm_ready_wait(ECNVM_TIMEOUT_COUNT);

            if((CNVM_READY == cnvm_state) && (ECNVM_READY == ecnvm_state)) {
                /* set the PG bit to start program */
                NVMC_CNVM_CTL |= NVMC_CNVM_CTL_PG;

                __ISB();
                __DSB();

                for(index = 0U; index < 4U; index++) {
                    /* use explicit doubleword store to guarantee atomic 64-bit write */
                    data_val = data[index];
                    __ASM volatile(
                        "strd %Q[data_val], %R[data_val], [%[addr]]\n"
                        :
                        : [addr] "r"(address), [data_val] "r"(data_val)
                        : "memory");
                    __DMB();
                    address += 8U;
                }

                /* wait for the CNVM ready */
                cnvm_state = _nvmc_cnvm_ready_wait(CNVM_TIMEOUT_COUNT);
                /* wait for the ecnvm ready */
                ecnvm_state = nvmc_ecnvm_ready_wait(ECNVM_TIMEOUT_COUNT);

                __ISB();
                __DSB();

                /* reset the PG bit */
                NVMC_CNVM_CTL &= ~NVMC_CNVM_CTL_PG;

                if((ECNVM_READY == ecnvm_state) && (CNVM_READY == cnvm_state)) {
                    status = SUCCESS;
                } else {
                    status = ERROR;
                }
            } else {
                status = ERROR;
            }
        } else {
            if(CNVM_READY == cnvm_state) {
                /* set the PG bit to start program */
                NVMC_CNVM_CTL |= NVMC_CNVM_CTL_PG;

                __ISB();
                __DSB();

                for(index = 0U; index < 4U; index++) {
                    /* use explicit doubleword store to guarantee atomic 64-bit write */
                    data_val = data[index];
                    __ASM volatile(
                        "strd %Q[data_val], %R[data_val], [%[addr]]\n"
                        :
                        : [addr] "r"(address), [data_val] "r"(data_val)
                        : "memory");
                    __DMB();
                    address += 8U;
                }

                /* wait for the CNVM ready */
                cnvm_state = _nvmc_cnvm_ready_wait(CNVM_TIMEOUT_COUNT);

                __ISB();
                __DSB();

                /* reset the PG bit */
                NVMC_CNVM_CTL &= ~NVMC_CNVM_CTL_PG;

                if(CNVM_READY == cnvm_state) {
                    status = SUCCESS;
                } else {
                    status = ERROR;
                }
            } else {
                status = ERROR;
            }
        }
    }
    return status;
}

/*!
    \brief      erase sector of CNVM (API_ID(0x0009U))
    \param[in]  address: sector address to erase
    \param[out] none
    \retval     state of CNVM
      \arg        CNVM_READY: CNVM operation has been completed
      \arg        CNVM_BUSY: CNVM operation is in progress
      \arg        CNVM_WPERR: CNVM erase/program protection error
      \arg        CNVM_PGSERR: CNVM program sequence error
      \arg        CNVM_RPERR: CNVM read protection error
      \arg        CNVM_RSERR: CNVM read secure error
      \arg        CNVM_TOERR: CNVM timeout error
*/
cnvm_state_enum nvmc_cnvm_sector_erase(uint32_t address)
{
    cnvm_state_enum cnvm_state = CNVM_READY;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CNVM_VALID_ADDRESS(address)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0009U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        /* wait for the CNVM ready */
        cnvm_state = nvmc_cnvm_ready_wait(CNVM_TIMEOUT_COUNT);

        if(CNVM_READY == cnvm_state) {
            NVMC_CNVM_CTL |= NVMC_CNVM_CTL_SER;
            /* write the sector address */
            NVMC_CNVM_ADDR = address;
            /* start sector erase */
            NVMC_CNVM_CTL |= NVMC_CNVM_CTL_START;
            /* wait for the CNVM ready */
            cnvm_state = _nvmc_cnvm_ready_wait(CNVM_TIMEOUT_COUNT);
            /* reset the SER bit */
            NVMC_CNVM_CTL &= (~NVMC_CNVM_CTL_SER);
        }
    }
    /* return the CNVM state */
    return cnvm_state;
}

#ifndef NVM_VER_1_625_AND_0
/*!
    \brief      erase whole CNVM (API_ID(0x000AU))
    \param[in]  none
    \param[out] none
    \retval     state of CNVM
      \arg        CNVM_READY: CNVM operation has been completed
      \arg        CNVM_BUSY: CNVM operation is in progress
      \arg        CNVM_WPERR: CNVM erase/program protection error
      \arg        CNVM_PGSERR: CNVM program sequence error
      \arg        CNVM_RPERR: CNVM read protection error
      \arg        CNVM_RSERR: CNVM read secure error
      \arg        CNVM_TOERR: CNVM timeout error
*/
cnvm_state_enum nvmc_cnvm_mass_erase(void)
{
    cnvm_state_enum cnvm_state = CNVM_READY;

    /* wait for the CNVM ready */
    cnvm_state = nvmc_cnvm_ready_wait(CNVM_TIMEOUT_COUNT);

    if(CNVM_READY == cnvm_state) {
        /* enable mass erase operation */
        NVMC_CNVM_CTL |= NVMC_CNVM_CTL_MER;
        /* start whole CNVM */
        NVMC_CNVM_CTL |= NVMC_CNVM_CTL_START;
        /* wait for the CNVM ready */
        cnvm_state = _nvmc_cnvm_ready_wait(CNVM_TIMEOUT_COUNT);
        /* reset the MER bit */
        NVMC_CNVM_CTL &= ~NVMC_CNVM_CTL_MER;
    }

    /* return the CNVM state */
    return cnvm_state;
}

/*!
    \brief      erase whole chip, including CNVM and ecnvm (API_ID(0x000BU))
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus nvmc_typical_chip_erase(void)
{
    ErrStatus status;
    cnvm_state_enum cnvm_state = CNVM_READY;
    ecnvm_state_enum ecnvm_state = ECNVM_READY;

    /* wait for the CNVM ready */
    cnvm_state = nvmc_cnvm_ready_wait(CNVM_TIMEOUT_COUNT);

    /* wait for the CNVM ready */
    ecnvm_state = nvmc_ecnvm_ready_wait(ECNVM_TIMEOUT_COUNT);

    if((CNVM_READY == cnvm_state) && (ECNVM_READY == ecnvm_state)) {
        /* enable chip erase operation */
        NVMC_CNVM_CTL |= NVMC_CNVM_CTL_CER;
        /* start whole chip erase */
        NVMC_CNVM_CTL |= NVMC_CNVM_CTL_START;
        /* wait for the CNVM ready */
        cnvm_state = _nvmc_cnvm_ready_wait(CNVM_TIMEOUT_COUNT);
        ecnvm_state = nvmc_ecnvm_ready_wait(ECNVM_TIMEOUT_COUNT);
        /* reset the CER bit */
        NVMC_CNVM_CTL &= ~NVMC_CNVM_CTL_CER;

