RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_nvmc.c
        if((ECNVM_READY == ecnvm_state) && (CNVM_READY == cnvm_state)) {
            status = SUCCESS;
        } else {
            status = ERROR;
        }
    } else {
        status = ERROR;
    }

    /* return the NVMC state */
    return status;
}

/*!
    \brief      erase whole chip, including CNVM and ecnvm, the secure area and dcrp area will also be erased (API_ID(0x000CU))
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus nvmc_protection_removed_chip_erase(void)
{
    ErrStatus status;
    cnvm_state_enum cnvm_state = CNVM_READY;
    ecnvm_state_enum ecnvm_state = ECNVM_READY;

    /* wait for the CNVM ready */
    cnvm_state = nvmc_cnvm_ready_wait(CNVM_TIMEOUT_COUNT);
    /* wait for the ECNVM ready */
    ecnvm_state = nvmc_ecnvm_ready_wait(ECNVM_TIMEOUT_COUNT);

    if((CNVM_READY == cnvm_state) && (ECNVM_READY == ecnvm_state)) {
        NVMC_ECNVM_CTL |= NVMC_ECNVM_CTL_CHIP_REMOVE_EN;
        /* remove DCRP area */
        NVMC_DCRPADDR_MDF = NVMC_DCRPADDR_MDF_DCRP_EREN_29_31 | INVALID_DCRP_START_ADDR;
        /* remove secure-access area */
        NVMC_SCRADDR_MDF = NVMC_SCRADDR_MDF_SCR_EREN_29_31 | INVALID_SCR_START_ADDR;
        /* disable all sectors' erase/program protection */
        NVMC_WP_CNVM_MDF = OB_CNVM_WP_ALL;
        NVMC_WP0_ECNVM_MDF = (uint32_t)(OB_ECNVM_WP_ALL & LOW_32BITS_MASK);

#if defined(NVM_VER_2_AND_7_5)
        NVMC_WP1_ECNVM_MDF = (uint32_t)(OB_ECNVM_WP_ALL >> WP1_ECNVM_OFFSET);
#endif /* NVM_VER_2_AND_7_5 */

        /* enable chip erase operation */
        NVMC_CNVM_CTL |= NVMC_CNVM_CTL_CER;
        /* start whole chip erase */
        NVMC_CNVM_CTL |= NVMC_CNVM_CTL_START;
        /* wait for the CNVM ready */
        cnvm_state = _nvmc_cnvm_ready_wait(CNVM_TIMEOUT_COUNT);
        /* wait for the ECNVM ready */
        ecnvm_state = nvmc_ecnvm_ready_wait(ECNVM_TIMEOUT_COUNT);
        /* reset the CER bit */
        NVMC_CNVM_CTL &= ~NVMC_CNVM_CTL_CER;

        if((ECNVM_READY == ecnvm_state) && (CNVM_READY == cnvm_state)) {
            status = SUCCESS;
        } else {
            status = ERROR;
        }
    } else {
        status = ERROR;
    }

    return status;
}
#else

/*!
    \brief      erase whole chip (API_ID(0x000DU))
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus nvmc_typical_chip_erase(void)
{
    ErrStatus status;
    cnvm_state_enum cnvm_state = CNVM_READY;

    /* wait for the CNVM ready */
    cnvm_state = nvmc_cnvm_ready_wait(CNVM_TIMEOUT_COUNT);

    if(CNVM_READY == cnvm_state) {
        /* enable chip erase operation */
        NVMC_CNVM_CTL |= NVMC_CNVM_CTL_CER;
        /* start whole chip erase */
        NVMC_CNVM_CTL |= NVMC_CNVM_CTL_START;
        /* wait for the CNVM ready */
        cnvm_state = _nvmc_cnvm_ready_wait(CNVM_TIMEOUT_COUNT);
        /* reset the CER bit */
        NVMC_CNVM_CTL &= ~NVMC_CNVM_CTL_CER;

        if(CNVM_READY == cnvm_state) {
            status = SUCCESS;
        } else {
            status = ERROR;
        }
    } else {
        status = ERROR;
    }

    return status;
}

/*!
    \brief      erase whole chip, including CNVM and ecnvm, the secure area and dcrp area will also be erased (API_ID(0x000EU))
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus nvmc_protection_removed_chip_erase(void)
{
    ErrStatus status;
    cnvm_state_enum cnvm_state = CNVM_READY;

    /* wait for the CNVM ready */
    cnvm_state = nvmc_cnvm_ready_wait(CNVM_TIMEOUT_COUNT);

    if(CNVM_READY == cnvm_state) {
        NVMC_ECNVM_CTL |= NVMC_ECNVM_CTL_CHIP_REMOVE_EN;
        /* remove DCRP area */
        NVMC_DCRPADDR_MDF = NVMC_DCRPADDR_MDF_CNVM_DCRP_EREN | INVALID_DCRP_START_ADDR;
        /* remove secure-access area */
        NVMC_SCRADDR_MDF = NVMC_SCRADDR_MDF_CNVM_SCR_EREN | INVALID_SCR_START_ADDR;
        /* disable all sectors' erase/program protection */
        NVMC_WP_CNVM_MDF = OB_CNVM_WP_ALL;

        /* enable chip erase operation */
        NVMC_CNVM_CTL |= NVMC_CNVM_CTL_CER;
        /* start whole chip erase */
        NVMC_CNVM_CTL |= NVMC_CNVM_CTL_START;
        /* wait for the CNVM ready */
        cnvm_state = _nvmc_cnvm_ready_wait(CNVM_TIMEOUT_COUNT);
        /* reset the CER bit */
        NVMC_CNVM_CTL &= ~NVMC_CNVM_CTL_CER;

        if(CNVM_READY == cnvm_state) {
            status = SUCCESS;
        } else {
            status = ERROR;
        }
    } else {
        status = ERROR;
    }

    return status;
}
#endif /* NVM_VER_1_625_AND_0 */

/*!
    \brief      CRC calculate CNVM data block (API_ID(0x000FU))
    \param[in]  none
    \param[out] crc_value: CRC calculate result
    \retval     state of CNVM
      \arg        CNVM_CRCREADY: CNVM CRC operation has been completed
      \arg        CNVM_CRCBUSY: CNVM CRC operation is in progress
      \arg        CNVM_CRCRERR: CNVM CRC read error
      \arg        CNVM_WPERR: CNVM erase/program protection error
      \arg        CNVM_PGSERR: CNVM program sequence error
      \arg        CNVM_RPERR: CNVM read protection error
      \arg        CNVM_RSERR: CNVM read secure error
      \arg        CNVM_TOERR: CNVM timeout error
*/
cnvm_state_enum nvmc_cnvm_crc_calculate(uint32_t *crc_value)
{
    cnvm_state_enum cnvm_state = CNVM_CRCREADY;

#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(crc_value)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x000FU), ERR_PARAM_POINTER);
    } else
#endif
    {
        /* wait for the CNVM CRC ready */
        cnvm_state = nvmc_cnvm_crc_ready_wait(CNVM_TIMEOUT_COUNT);

        if(CNVM_CRCREADY == cnvm_state) {
            /* start CRC calculate */
            NVMC_CNVM_CTL |= NVMC_CNVM_CTL_CRCSTART;
            /* wait for the CNVM ready */
            cnvm_state = nvmc_cnvm_crc_ready_wait(CNVM_TIMEOUT_COUNT);

            if(CNVM_CRCREADY == cnvm_state) {
                *crc_value = NVMC_CNVM_CRCRESULT;
            }
        }
    }
    /* return the CNVM state */
    return cnvm_state;
}

/*!
    \brief      cnvm ecc mode config (API_ID(0x0010U))
    \param[in]  ecc_mode: cnvm ecc mode
                only one parameter can be selected which is shown as below:
      \arg        CNVM_ECC_MODE_ENABLE_ECC_FUNCTION: Enable ECC function
      \arg        CNVM_ECC_MODE_SKIP_ECC_WITH_REDUNDANT_ROW: The ECC code value is 0 when writing, and the ECC is skipped when reading. Consider CNVM redundant rowsr
      \arg        CNVM_ECC_MODE_SKIP_ECC: Only bits corresponding to valid data are written, and ECC is skipped when reading
      \arg        CNVM_ECC_MODE_SKIP_ECC_WITHOUT_REDUNDANT_ROW: The ECC code value is 0 when writing, and the ECC is skipped when reading. Do not consider CNVM redundant rows
    \param[out] none
    \retval     state of CNVM
      \arg        CNVM_READY: CNVM operation has been completed
      \arg        CNVM_BUSY: CNVM operation is in progress
      \arg        CNVM_WPERR: CNVM erase/program protection error
      \arg        CNVM_PGSERR: CNVM program sequence error
      \arg        CNVM_RPERR: CNVM read protection error
      \arg        CNVM_RSERR: CNVM read secure error
      \arg        CNVM_TOERR: CNVM timeout error
*/
cnvm_state_enum nvmc_cnvm_ecc_mode_config(uint32_t ecc_mode)
{
    uint32_t cnvm_ctl_reg;
    cnvm_state_enum cnvm_state = CNVM_READY;

    /* wait for CNVM ready */
    cnvm_state = nvmc_cnvm_ready_wait(CNVM_TIMEOUT_COUNT);

