RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_nvmc.c
    if(CNVM_READY == cnvm_state) {
        cnvm_ctl_reg = NVMC_CNVM_CTL;
        cnvm_ctl_reg &= ~NVMC_CNVM_CTL_CNVM_ECC_MODE;
        cnvm_ctl_reg |= (ecc_mode & NVMC_CNVM_CTL_CNVM_ECC_MODE);
        NVMC_CNVM_CTL = cnvm_ctl_reg;
        /* wait for CNVM ready */
        cnvm_state = nvmc_cnvm_ready_wait(CNVM_TIMEOUT_COUNT);
    }

    return cnvm_state;
}

/*!
    \brief      enable cnvm ecc mode config lock (API_ID(0x0011U))
    \param[in]  none
    \param[out] none
    \retval     state of CNVM
      \arg        CNVM_READY: CNVM operation has been completed
      \arg        CNVM_BUSY: CNVM operation is in progress
      \arg        CNVM_WPERR: CNVM erase/program protection error
      \arg        CNVM_PGSERR: CNVM program sequence error
      \arg        CNVM_RPERR: CNVM read protection error
      \arg        CNVM_RSERR: CNVM read secure error
      \arg        CNVM_TOERR: CNVM timeout error
*/
cnvm_state_enum nvmc_cnvm_ecc_mode_lock(void)
{
    cnvm_state_enum cnvm_state = CNVM_READY;

    /* wait for CNVM ready */
    cnvm_state = nvmc_cnvm_ready_wait(CNVM_TIMEOUT_COUNT);

    if(CNVM_READY == cnvm_state) {
        /* enable cnvm ecc mode lock */
        NVMC_CNVM_CTL |= NVMC_CNVM_CTL_CNVM_ECC_LK;
        /* wait for CNVM ready */
        cnvm_state = nvmc_cnvm_ready_wait(CNVM_TIMEOUT_COUNT);
    }

    /* return the CNVM state */
    return cnvm_state;
}

/*!
    \brief      software trigger CNVM repair (API_ID(0x0012U))
    \param[in]  none
    \param[out] none
    \retval     state of CNVM
      \arg        CNVM_REPAIR_READY: CNVM self-repair has been completed
      \arg        CNVM_REPAIR_BUSY: CNVM repair operation is in progress
      \arg        CNVM_REPAIR_ECNVM_BLANK: CNVM ECNVM data integrity enhancement content is blank error
      \arg        CNVM_REPAIR_REPSTRERR: CNVM self-check repair configuration error
      \arg        CNVM_TOERR: CNVM timeout error
*/
cnvm_state_enum nvmc_cnvm_repair(void)
{
    cnvm_state_enum cnvm_state = CNVM_REPAIR_READY;

    /* wait for the CNVM repair ready */
    cnvm_state = nvmc_cnvm_repair_ready_wait(CNVM_TIMEOUT_COUNT);

    if(CNVM_REPAIR_READY == cnvm_state) {
        /* start software trigger repair */
        NVMC_CNVM_REPCS |= NVMC_CNVM_REPCS_REPSTART;
        /* wait for the CNVM ready */
        cnvm_state = nvmc_cnvm_repair_ready_wait(CNVM_TIMEOUT_COUNT);
    }

    /* return the CNVM state */
    return cnvm_state;
}

/*!
    \brief      get CNVM read only bad block address that still has the error after self-repair (API_ID(0x0013U))
    \param[in]  index: number of read only bad block (index = 0 - 3)
    \param[out] bad_block_address: bad block address
    \param[out] error_stat: error status after self-check
    \retval     state of bad block address
      \arg        INVLD_ADDRESS_FLAG: the address is invalid
      \arg        VLD_ADDRESS_FLAG: the address is valid
*/
uint8_t nvmc_cnvm_read_only_bad_block_address_get(uint32_t index, uint32_t *bad_block_address, uint32_t *error_stat)
{
    uint8_t address_stat = INVLD_ADDRESS_FLAG;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_BADBLOCK_VALID_ADDRESS_INDEX(index)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0013U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_VALID_POINTER(bad_block_address)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0013U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(error_stat)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0013U), ERR_PARAM_POINTER);
    } else
#endif
    {
        *error_stat = ((NVMC_CNVM_ROBBADDRX(index) & NVMC_CNVM_ROBBADDRX_ROBBADDRSTAT) >> ROBBADDRX_ROBBADDRSTAT_OFFSET);
        if(*error_stat) {
            *bad_block_address = NVMC_CNVM_ROBBADDRX(index) & (~NVMC_CNVM_ROBBADDRX_ROBBADDRSTAT);
            /* valid bad block address */
            address_stat = VLD_ADDRESS_FLAG;
        } else {
            *bad_block_address = 0xFFFFFFFFU;
            /* no valid bad block address */
            address_stat = INVLD_ADDRESS_FLAG;
        }
    }
    return address_stat;
}

/*!
    \brief      get CNVM flag set or reset (API_ID(0x0014U))
    \param[in]  cnvm_flag: CNVM flag
                only one parameter can be selected which is shown as below:
      \arg        CNVM_FLAG_BUSY: CNVM busy flag
      \arg        CNVM_FLAG_ENDF: CNVM end of operation flag
      \arg        CNVM_FLAG_WPERR: CNVM write protection error flag
      \arg        CNVM_FLAG_PGSERR: CNVM program sequence error flag
      \arg        CNVM_FLAG_OTAFAIL: CNVM OTA update, check_bootloader check failure flag
      \arg        CNVM_FLAG_OTASUC: CNVM OTA update, check_bootloader check success flag
      \arg        CNVM_FLAG_UPDATESTRERR: CNVM update startup failure error flag
      \arg        CNVM_FLAG_RPERR: CNVM read protection error flag
      \arg        CNVM_FLAG_RSERR: CNVM read secure error flag
      \arg        CNVM_FLAG_AUTOECCDERRDET: CNVM two bits detect error flag
      \arg        CNVM_FLAG_CRCCALEND: CNVM CRC end of calculation flag
      \arg        CNVM_FLAG_CRCRERR: CNVM CRC read error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_cnvm_flag_get(uint32_t cnvm_flag)
{
    FlagStatus reval = RESET;

    if(NVMC_CNVM_STAT & cnvm_flag) {
        reval = SET;
    }
    /* return the state of corresponding CNVM flag */
    return reval;
}

/*!
    \brief      clear CNVM flag (API_ID(0x0015U))
    \param[in]  cnvm_flag: CNVM flag
                one or more parameters can be selected which is shown as below:
      \arg        CNVM_FLAG_ENDF: CNVM end of operation flag
      \arg        CNVM_FLAG_WPERR: CNVM write protection error flag
      \arg        CNVM_FLAG_PGSERR: CNVM program sequence error flag
      \arg        CNVM_FLAG_OTAFAIL: CNVM OTA update, check_bootloader check failure flag
      \arg        CNVM_FLAG_OTASUC: CNVM OTA update, check_bootloader check success flag
      \arg        CNVM_FLAG_UPDATESTRERR: CNVM update startup failure error flag
      \arg        CNVM_FLAG_RPERR: CNVM read protection error flag
      \arg        CNVM_FLAG_RSERR: CNVM read secure error flag
      \arg        CNVM_FLAG_CRCCALEND: CNVM CRC end of calculation flag
      \arg        CNVM_FLAG_CRCRERR: CNVM CRC read error flag
    \param[out] none
    \retval     none
*/
void nvmc_cnvm_flag_clear(uint32_t cnvm_flag)
{
    uint32_t reg_value;

    reg_value = NVMC_CNVM_STAT;
    reg_value &= ~(CNVM_FLAG_ENDF | CNVM_FLAG_WPERR | CNVM_FLAG_PGSERR | CNVM_FLAG_OTAFAIL | CNVM_FLAG_OTASUC | CNVM_FLAG_UPDATESTRERR | CNVM_FLAG_RPERR |
                   CNVM_FLAG_RSERR | CNVM_FLAG_CRCCALEND | CNVM_FLAG_CRCRERR);
    reg_value |= cnvm_flag;

    /* clear the flags */
    NVMC_CNVM_STAT = reg_value;
}

/*!
    \brief      enable CNVM interrupt (API_ID(0x0016U))
    \param[in]  cnvm_int: the CNVM interrupt source
                one or more parameters can be selected which is shown as below:
      \arg        CNVM_INT_ENDIE: CNVM end of operation interrupt enable bit
      \arg        CNVM_INT_WPERRIE: CNVM write protection error interrupt enable bit
      \arg        CNVM_INT_PGSERRIE: CNVM program sequence error interrupt enable bit
      \arg        CNVM_INT_RPERRIE: CNVM read protection error interrupt enable bit
      \arg        CNVM_INT_RSERRIE: CNVM read secure error interrupt enable bit
      \arg        CNVM_INT_AUTOECCDERRDETIE: CNVM two bits detect error interrupt enable bit
      \arg        CNVM_INT_CRCCALENDIE: CNVM CRC end of calculation interrupt enable bit
      \arg        CNVM_INT_CRCRERRIE: CNVM CRC read error interrupt enable bit
    \param[out] none
    \retval     none
*/
void nvmc_cnvm_interrupt_enable(uint32_t cnvm_int)
{
    NVMC_CNVM_CTL |= cnvm_int;
}

/*!
    \brief      disable CNVM interrupt (API_ID(0x0017U))
    \param[in]  cnvm_int: the CNVM interrupt source
                one or more parameters can be selected which is shown as below:
      \arg        CNVM_INT_ENDIE: CNVM end of operation interrupt enable bit
      \arg        CNVM_INT_WPERRIE: CNVM write protection error interrupt enable bit
      \arg        CNVM_INT_PGSERRIE: CNVM program sequence error interrupt enable bit
      \arg        CNVM_INT_RPERRIE: CNVM read protection error interrupt enable bit
      \arg        CNVM_INT_RSERRIE: CNVM read secure error interrupt enable bit
      \arg        CNVM_INT_AUTOECCDERRDETIE: CNVM two bits detect error interrupt enable bit
      \arg        CNVM_INT_CRCCALENDIE: CNVM CRC end of calculation interrupt enable bit
      \arg        CNVM_INT_CRCRERRIE: CNVM CRC read error interrupt enable bit
    \param[out] none
    \retval     none
*/
void nvmc_cnvm_interrupt_disable(uint32_t cnvm_int)
{
    NVMC_CNVM_CTL &= ~(uint32_t)cnvm_int;
}

/*!
    \brief      get CNVM interrupt flag status (API_ID(0x0018U))
    \param[in]  cnvm_int_flag: CNVM interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        CNVM_INT_FLAG_ENDF: CNVM end of operation interrupt flag
      \arg        CNVM_INT_FLAG_WPERR: CNVM write protection error interrupt flag
      \arg        CNVM_INT_FLAG_PGSERR: CNVM program sequence error interrupt flag
      \arg        CNVM_INT_FLAG_RPERR: CNVM read protection error interrupt flag
      \arg        CNVM_INT_FLAG_RSERR: CNVM read secure error interrupt flag
      \arg        CNVM_INT_FLAG_AUTOECCDERRDET: CNVM two bits detect error interrupt flag
      \arg        CNVM_INT_FLAG_CRCCALEND: CNVM CRC end of calculation interrupt flag
      \arg        CNVM_INT_FLAG_CRCRERR: CNVM CRC read error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_cnvm_interrupt_flag_get(uint8_t cnvm_int_flag)
{
    FlagStatus reval = RESET;

    uint32_t reg1 = NVMC_CNVM_STAT;
    uint32_t reg2 = NVMC_CNVM_CTL;

    switch(cnvm_int_flag) {
    /* CNVM end of operation interrupt */
    case CNVM_INT_FLAG_ENDF:
        reg1 = reg1 & NVMC_CNVM_STAT_ENDF;
        reg2 = reg2 & NVMC_CNVM_CTL_ENDIE;
        break;
    /* CNVM write protection error interrupt */
    case CNVM_INT_FLAG_WPERR:
        reg1 = reg1 & NVMC_CNVM_STAT_WPERR;
        reg2 = reg2 & NVMC_CNVM_CTL_WPERRIE;
        break;
    /* CNVM program sequence error interrupt */
    case CNVM_INT_FLAG_PGSERR:
        reg1 = reg1 & NVMC_CNVM_STAT_PGSERR;
        reg2 = reg2 & NVMC_CNVM_CTL_PGSERRIE;
        break;
    /* CNVM read protection error interrupt */
    case CNVM_INT_FLAG_RPERR:
        reg1 = reg1 & NVMC_CNVM_STAT_RPERR;
        reg2 = reg2 & NVMC_CNVM_CTL_RPERRIE;
        break;
    /* CNVM read secure error interrupt */
    case CNVM_INT_FLAG_RSERR:
        reg1 = reg1 & NVMC_CNVM_STAT_RSERR;
        reg2 = reg2 & NVMC_CNVM_CTL_RSERRIE;
        break;
    /* CNVM two bits detect error interrupt */
    case CNVM_INT_FLAG_AUTOECCDERRDET:
        reg1 = reg1 & NVMC_CNVM_STAT_AUTOECCDERRDET;
        reg2 = reg2 & NVMC_CNVM_CTL_AUTOECCDERRDETIE;
        break;
    /* CNVM CRC end of calculation interrupt */
    case CNVM_INT_FLAG_CRCCALEND:
        reg1 = reg1 & NVMC_CNVM_STAT_CRCENDCAL;
        reg2 = reg2 & NVMC_CNVM_CTL_CRCENDCALIE;
        break;
    /* CNVM CRC read error interrupt */
    case CNVM_INT_FLAG_CRCRERR:
        reg1 = reg1 & NVMC_CNVM_STAT_CRCRERR;
        reg2 = reg2 & NVMC_CNVM_CTL_CRCRERRIE;
        break;
    default :
        break;
    }
    /*get CNVM interrupt flag status */
    if((0U != reg1) && (0U != reg2)) {
        reval = SET;
    }

    return reval;
}

/*!
    \brief      clear CNVM interrupt flag status (API_ID(0x0019U))
    \param[in]  cnvm_int_flag: CNVM interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        CNVM_INT_FLAG_ENDF: CNVM end of operation interrupt flag
      \arg        CNVM_INT_FLAG_WPERR: CNVM write protection error interrupt flag
      \arg        CNVM_INT_FLAG_PGSERR: CNVM program sequence error interrupt flag
      \arg        CNVM_INT_FLAG_RPERR: CNVM read protection error interrupt flag
      \arg        CNVM_INT_FLAG_RSERR: CNVM read secure error interrupt flag
      \arg        CNVM_INT_FLAG_CRCCALEND: CNVM CRC end of calculation interrupt flag
      \arg        CNVM_INT_FLAG_CRCRERR: CNVM CRC read error interrupt flag
    \param[out] none
    \retval     none
*/
void nvmc_cnvm_interrupt_flag_clear(uint8_t cnvm_int_flag)
{

    switch(cnvm_int_flag) {
    /* CNVM end of operation interrupt */
    case CNVM_INT_FLAG_ENDF:
        NVMC_CNVM_STAT |= NVMC_CNVM_STAT_ENDF;
        break;
    /* CNVM write protection error interrupt */
    case CNVM_INT_FLAG_WPERR:
        NVMC_CNVM_STAT |= NVMC_CNVM_STAT_WPERR;
        break;
    /* CNVM program sequence error interrupt */
    case CNVM_INT_FLAG_PGSERR:
        NVMC_CNVM_STAT |= NVMC_CNVM_STAT_PGSERR;
        break;
    /* CNVM read protection error interrupt */
    case CNVM_INT_FLAG_RPERR:
        NVMC_CNVM_STAT |= NVMC_CNVM_STAT_RPERR;
        break;
    /* CNVM read secure error interrupt */
    case CNVM_INT_FLAG_RSERR:
        NVMC_CNVM_STAT |= NVMC_CNVM_STAT_RSERR;
        break;
    /* CNVM CRC end of calculation interrupt */
    case CNVM_INT_FLAG_CRCCALEND:
        NVMC_CNVM_STAT |= NVMC_CNVM_STAT_CRCENDCAL;
        break;
    /* CNVM CRC read error interrupt */
    case CNVM_INT_FLAG_CRCRERR:
        NVMC_CNVM_STAT |= NVMC_CNVM_STAT_CRCRERR;
        break;
    default :
        break;
    }
}

/*!
    \brief      get CNVM repair flag set or reset (API_ID(0x001AU))
    \param[in]  cnvm_repair_flag: CNVM repair flag
                only one parameter can be selected which is shown as below:
      \arg        CNVM_FLAG_REPAIR_ECNVM_BLANK: CNVM ECNVM data integrity enhancement content is blank flag
      \arg        CNVM_FLAG_REPAIR_END: CNVM self-repair end flag
      \arg        CNVM_FLAG_REPAIR_REPSTRERR: CNVM self-check repair configuration error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_cnvm_repair_flag_get(uint32_t cnvm_repair_flag)
{
    FlagStatus reval = RESET;

    if(NVMC_CNVM_REPCS & cnvm_repair_flag) {
        reval = SET;
    }
    /* return the state of corresponding CNVM flag */
    return reval;
}

/*!
    \brief      clear CNVM repair flag (API_ID(0x001BU))
    \param[in]  cnvm_repair_flag: CNVM repair flag
                one or more parameters can be selected which is shown as below:
      \arg        CNVM_FLAG_REPAIR_ECNVM_BLANK: CNVM ECNVM data integrity enhancement content is blank flag
      \arg        CNVM_FLAG_REPAIR_END: CNVM self-repair end flag
      \arg        CNVM_FLAG_REPAIR_REPSTRERR: CNVM self-check repair configuration error flag
    \param[out] none
    \retval     none
*/
void nvmc_cnvm_repair_flag_clear(uint32_t cnvm_repair_flag)
{
    uint32_t reg_value;

