RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_nvmc.c
    reg_value = NVMC_CNVM_REPCS;
    reg_value &= ~(CNVM_FLAG_REPAIR_ECNVM_BLANK | CNVM_FLAG_REPAIR_END |
                   CNVM_FLAG_REPAIR_REPSTRERR);
    reg_value |= cnvm_repair_flag;

    /* clear the flags */
    NVMC_CNVM_REPCS = reg_value;
}

/*!
    \brief      enable CNVM repair interrupt (API_ID(0x001CU))
    \param[in]  cnvm_repair_int: the CNVM repair interrupt source
                one or more parameters can be selected which is shown as below:
      \arg        CNVM_INT_REPAIR_ECNVM_BLANKIE: CNVM ECNVM data integrity enhancement content is blank interrupt enable bit
      \arg        CNVM_INT_REPAIR_DONEIE: CNVM self-repair done interrupt enable bit
    \param[out] none
    \retval     none
*/
void nvmc_cnvm_repair_interrupt_enable(uint32_t cnvm_repair_int)
{
    uint32_t reg;

    reg = NVMC_CNVM_REPCS;
    reg &= ~(NVMC_CNVM_REPCS_ECNVM_BLANK | NVMC_CNVM_REPCS_REPEND |
             NVMC_CNVM_REPCS_REPSTRERR);
    reg |= (uint32_t)cnvm_repair_int;
    NVMC_CNVM_REPCS = reg;
}

/*!
    \brief      disable CNVM repair interrupt (API_ID(0x001DU))
    \param[in]  cnvm_repair_int: the CNVM repair interrupt source
                one or more parameters can be selected which is shown as below:
      \arg        CNVM_INT_REPAIR_ECNVM_BLANKIE: CNVM ECNVM data integrity enhancement content is blank interrupt enable bit
      \arg        CNVM_INT_REPAIR_DONEIE: CNVM self-repair done interrupt enable bit
    \param[out] none
    \retval     none
*/
void nvmc_cnvm_repair_interrupt_disable(uint32_t cnvm_repair_int)
{
    uint32_t reg;

    reg = NVMC_CNVM_REPCS;
    reg &= ~(NVMC_CNVM_REPCS_ECNVM_BLANK | NVMC_CNVM_REPCS_REPEND |
             NVMC_CNVM_REPCS_REPSTRERR);
    reg &= ~(uint32_t)cnvm_repair_int;
    NVMC_CNVM_REPCS = reg;
}

/*!
    \brief      get CNVM repair interrupt flag status (API_ID(0x001EU))
    \param[in]  cnvm_repair_int_flag: CNVM repair interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        CNVM_INT_FLAG_REPAIR_ECNVM_BLANK: CNVM ECNVM data integrity enhancement content is blank interrupt flag
      \arg        CNVM_INT_FLAG_REPAIR_END: CNVM self-repair end interrupt flag
      \arg        CNVM_INT_FLAG_REPAIR_REPSTRERR: CNVM self-check repair configuration error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_cnvm_repair_interrupt_flag_get(uint8_t cnvm_repair_int_flag)
{
    FlagStatus reval = RESET;

    uint32_t reg1 = NVMC_CNVM_REPCS;
    uint32_t reg2 = NVMC_CNVM_REPCS;

    switch(cnvm_repair_int_flag) {
    /* CNVM ECNVM data integrity enhancement content is blank interrupt */
    case CNVM_INT_FLAG_REPAIR_ECNVM_BLANK:
        reg1 = reg1 & NVMC_CNVM_REPCS_ECNVM_BLANK;
        reg2 = reg2 & NVMC_CNVM_REPCS_ECNVM_BLANKIE;
        break;
    /* CNVM self-repair end interrupt */
    case CNVM_INT_FLAG_REPAIR_END:
        reg1 = reg1 & NVMC_CNVM_REPCS_REPEND;
        reg2 = reg2 & NVMC_CNVM_REPCS_REPDONEIE;
        break;
    /* CNVM self-check repair configuration error interrupt */
    case CNVM_INT_FLAG_REPAIR_REPSTRERR:
        reg1 = reg1 & NVMC_CNVM_REPCS_REPSTRERR;
        reg2 = reg2 & NVMC_CNVM_REPCS_REPDONEIE;
        break;
    default :
        break;
    }
    /*get CNVM repair interrupt flag status */
    if((0U != reg1) && (0U != reg2)) {
        reval = SET;
    }

    return reval;
}

/*!
    \brief      clear CNVM repair interrupt flag status (API_ID(0x001FU))
    \param[in]  cnvm_repair_int_flag: CNVM repair interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        CNVM_INT_FLAG_REPAIR_ECNVM_BLANK: CNVM ECNVM data integrity enhancement content is blank interrupt flag
      \arg        CNVM_INT_FLAG_REPAIR_END: CNVM self-repair end interrupt flag
      \arg        CNVM_INT_FLAG_REPAIR_REPSTRERR: CNVM self-check repair configuration error interrupt flag
    \param[out] none
    \retval     none
*/
void nvmc_cnvm_repair_interrupt_flag_clear(uint8_t cnvm_repair_int_flag)
{

    switch(cnvm_repair_int_flag) {
    /* CNVM ECNVM data integrity enhancement content is blank interrupt */
    case CNVM_INT_FLAG_REPAIR_ECNVM_BLANK:
        NVMC_CNVM_REPCS |= NVMC_CNVM_REPCS_ECNVM_BLANK;
        break;
    /* CNVM self-repair end interrupt */
    case CNVM_INT_FLAG_REPAIR_END:
        NVMC_CNVM_REPCS |= NVMC_CNVM_REPCS_REPEND;
        break;
    /* CNVM self-check repair configuration error interrupt */
    case CNVM_INT_FLAG_REPAIR_REPSTRERR:
        NVMC_CNVM_REPCS |= NVMC_CNVM_REPCS_REPSTRERR;
        break;
    default :
        break;
    }

}

/*!
    \brief      get the number of error count fail to repair during self-check (API_ID(0x0020U))
    \param[in]  none
    \param[out] none
    \retval     the number of error count fail to repair
*/
uint8_t nvmc_cnvm_robbcnt_get(void)
{
    return (uint8_t)((NVMC_CNVM_REPCS & NVMC_CNVM_REPCS_ROBBCNT) >> CNVM_REPCS_ROBBCNT_OFFSET);
}

/*!
    \brief      get the error status during self-check (API_ID(0x0021U))
    \param[in]  none
    \param[out] none
    \retval     the error status
*/
uint8_t nvmc_cnvm_repair_error_status_get(void)
{
    return (uint8_t)((NVMC_CNVM_REPCS & NVMC_CNVM_REPCS_REPERRSTAT) >> CNVM_REPCS_REPERRSTAT_OFFSET);
}

/*!
    \brief      clear the number of error count fail to repair during self-check (API_ID(0x0022U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_cnvm_robbcnt_clear(void)
{
    uint32_t reg_value;

    reg_value = NVMC_CNVM_REPCS;
    /* keep repair flag unchanged */
    reg_value &= ~(CNVM_FLAG_REPAIR_ECNVM_BLANK | CNVM_FLAG_REPAIR_END |
                   CNVM_FLAG_REPAIR_REPSTRERR);
    reg_value &= ~NVMC_CNVM_REPCS_ROBBCNT;

    /* clear the robbcnt */
    NVMC_CNVM_REPCS = reg_value;
}

/*!
    \brief      clear error status during self-check (API_ID(0x0023U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_cnvm_repair_error_status_clear(void)
{
    uint32_t reg_value;

