RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_nvmc.c
    reg_value = NVMC_CNVM_REPCS;
    /* keep repair flag unchanged */
    reg_value &= ~(CNVM_FLAG_REPAIR_ECNVM_BLANK | CNVM_FLAG_REPAIR_END |
                   CNVM_FLAG_REPAIR_REPSTRERR);
    reg_value &= ~NVMC_CNVM_REPCS_REPERRSTAT;

    /* clear the repair status */
    NVMC_CNVM_REPCS = reg_value;
}

/*!
    \brief      clear the result of repair during self-check, including counter, error address, and status (API_ID(0x0024U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_cnvm_self_check_repair_flag_clear(void)
{
    uint32_t reg_value;

    reg_value = NVMC_CNVM_CTL;
    reg_value |= NVMC_CNVM_CTL_REPRESC;

    /* clear the flags */
    NVMC_CNVM_CTL = reg_value;
}

/*!
    \brief      get CNVM state (exclude CNVM crc operation) (API_ID(0x0025U))
    \param[in]  none
    \param[out] none
    \retval     state of CNVM
      \arg        CNVM_READY: CNVM operation has been completed
      \arg        CNVM_BUSY: CNVM operation is in progress
      \arg        CNVM_WPERR: CNVM erase/program protection error
      \arg        CNVM_PGSERR: CNVM program sequence error
      \arg        CNVM_RPERR: CNVM read protection error
      \arg        CNVM_RSERR: CNVM read secure error
*/
static cnvm_state_enum nvmc_cnvm_state_get(void)
{
    cnvm_state_enum cnvm_state = CNVM_READY;

    if(CNVM_FLAG_BUSY == (NVMC_CNVM_STAT & CNVM_FLAG_BUSY)) {
        cnvm_state = CNVM_BUSY;
    } else if(RESET != (NVMC_CNVM_STAT & CNVM_FLAG_WPERR)) {
        cnvm_state = CNVM_WPERR;
    } else if(RESET != (NVMC_CNVM_STAT & CNVM_FLAG_RSERR)) {
        cnvm_state = CNVM_RSERR;
    } else if(RESET != (NVMC_CNVM_STAT & CNVM_FLAG_RPERR)) {
        cnvm_state = CNVM_RPERR;
    } else if(RESET != (NVMC_CNVM_STAT & CNVM_FLAG_PGSERR)) {
        cnvm_state = CNVM_PGSERR;
    } else {
        cnvm_state = CNVM_READY;
    }

    /* return the CNVM state */
    return cnvm_state;
}

/*!
    \brief      check whether CNVM is ready or not (exclude CNVM crc operation) (API_ID(0x0026U))
    \param[in]  timeout: timeout count (0x00000000 - 0xFFFFFFFF)
    \param[out] none
    \retval     state of CNVM
      \arg        CNVM_READY: CNVM operation has been completed
      \arg        CNVM_BUSY: CNVM operation is in progress
      \arg        CNVM_WPERR: CNVM erase/program protection error
      \arg        CNVM_PGSERR: CNVM program sequence error
      \arg        CNVM_RPERR: CNVM read protection error
      \arg        CNVM_RSERR: CNVM read secure error
      \arg        CNVM_TOERR: CNVM timeout error
    \note       This function contains scenarios leading to an infinite loop.
                Modify according to the user's actual usage scenarios.
*/
static cnvm_state_enum nvmc_cnvm_ready_wait(uint32_t timeout)
{
    cnvm_state_enum cnvm_state = CNVM_BUSY;

    /* wait for CNVM ready */
    do {
        /* get CNVM state */
        cnvm_state = nvmc_cnvm_state_get();
        timeout--;
    } while((CNVM_BUSY == cnvm_state) && (0U != timeout));

    if(CNVM_BUSY == cnvm_state) {
        cnvm_state = CNVM_TOERR;
    }
    /* return the CNVM state */
    return cnvm_state;
}

/*!
    \brief      check whether CNVM is ready or not (exclude CNVM crc operation) (API_ID(0x0027U))
    \param[in]  timeout: timeout count (0x00000000 - 0xFFFFFFFF)
    \param[out] none
    \retval     state of CNVM
      \arg        CNVM_READY: CNVM operation has been completed
      \arg        CNVM_BUSY: CNVM operation is in progress
      \arg        CNVM_WPERR: CNVM erase/program protection error
      \arg        CNVM_PGSERR: CNVM program sequence error
      \arg        CNVM_RPERR: CNVM read protection error
      \arg        CNVM_RSERR: CNVM read secure error
      \arg        CNVM_TOERR: CNVM timeout error
    \note       This function contains scenarios leading to an infinite loop.
                Modify according to the user's actual usage scenarios.
*/
static cnvm_state_enum _nvmc_cnvm_ready_wait(uint32_t timeout)
{
    cnvm_state_enum cnvm_state = CNVM_BUSY;
    uint32_t wait_busy_timeout = 0U;

    while((!(NVMC_CNVM_STAT & CNVM_FLAG_BUSY)) && (wait_busy_timeout < 0xFFU)) {
        wait_busy_timeout++;
    }

    /* wait for CNVM ready */
    do {
        /* get CNVM state */
        cnvm_state = nvmc_cnvm_state_get();
        timeout--;
    } while((CNVM_BUSY == cnvm_state) && (0U != timeout));

    if(CNVM_BUSY == cnvm_state) {
        cnvm_state = CNVM_TOERR;
    }
    /* return the CNVM state */
    return cnvm_state;
}

/*!
    \brief      get CNVM crc state (API_ID(0x0028U))
    \param[in]  none
    \param[out] none
    \retval     state of CNVM
      \arg        CNVM_CRCREADY: CNVM CRC operation has been completed
      \arg        CNVM_CRCBUSY: CNVM CRC operation is in progress
      \arg        CNVM_CRCRERR: CNVM CRC read error
      \arg        CNVM_WPERR: CNVM erase/program protection error
      \arg        CNVM_PGSERR: CNVM program sequence error
      \arg        CNVM_RPERR: CNVM read protection error
      \arg        CNVM_RSERR: CNVM read secure error
*/
static cnvm_state_enum nvmc_cnvm_crc_state_get(void)
{
    cnvm_state_enum cnvm_state = CNVM_CRCREADY;

    if(CNVM_FLAG_CRCBUSY == (NVMC_CNVM_STAT & CNVM_FLAG_CRCBUSY)) {
        cnvm_state = CNVM_CRCBUSY;
    } else if(RESET != (NVMC_CNVM_STAT & CNVM_FLAG_WPERR)) {
        cnvm_state = CNVM_WPERR;
    } else if(RESET != (NVMC_CNVM_STAT & CNVM_FLAG_RSERR)) {
        cnvm_state = CNVM_RSERR;
    } else if(RESET != (NVMC_CNVM_STAT & CNVM_FLAG_RPERR)) {
        cnvm_state = CNVM_RPERR;
    } else if(RESET != (NVMC_CNVM_STAT & CNVM_FLAG_PGSERR)) {
        cnvm_state = CNVM_PGSERR;
    } else if(RESET != (NVMC_CNVM_STAT & CNVM_FLAG_CRCRERR)) {
        cnvm_state = CNVM_CRCRERR;
    } else {
        cnvm_state = CNVM_CRCREADY;
    }

    /* return the CNVM state */
    return cnvm_state;
}

/*!
    \brief      check whether CNVM crc is ready or not (API_ID(0x0029U))
    \param[in]  timeout: timeout count (0x00000000 - 0xFFFFFFFF)
    \param[out] none
    \retval     state of CNVM
      \arg        CNVM_CRCREADY: CNVM CRC operation has been completed
      \arg        CNVM_CRCBUSY: CNVM CRC operation is in progress
      \arg        CNVM_CRCRERR: CNVM CRC read error
      \arg        CNVM_WPERR: CNVM erase/program protection error
      \arg        CNVM_PGSERR: CNVM program sequence error
      \arg        CNVM_RPERR: CNVM read protection error
      \arg        CNVM_RSERR: CNVM read secure error
      \arg        CNVM_TOERR: CNVM timeout error
    \note       This function contains scenarios leading to an infinite loop.
                Modify according to the user's actual usage scenarios.
*/
static cnvm_state_enum nvmc_cnvm_crc_ready_wait(uint32_t timeout)
{
    cnvm_state_enum cnvm_state = CNVM_CRCBUSY;

    /* wait for CNVM ready */
    do {
        /* get CNVM state */
        cnvm_state = nvmc_cnvm_crc_state_get();
        timeout--;
    } while((CNVM_CRCBUSY == cnvm_state) && (0U != timeout));

    if(CNVM_CRCBUSY == cnvm_state) {
        cnvm_state = CNVM_TOERR;
    }
    /* return the CNVM state */
    return cnvm_state;
}

/*!
    \brief      get CNVM repair state (API_ID(0x002AU))
    \param[in]  none
    \param[out] none
    \retval     state of CNVM
      \arg        CNVM_REPAIR_READY: CNVM self-repair has been completed
      \arg        CNVM_REPAIR_BUSY: CNVM repair operation is in progress
      \arg        CNVM_REPAIR_ECNVM_BLANK: CNVM ECNVM data integrity enhancement content is blank error
      \arg        CNVM_REPAIR_REPSTRERR: CNVM self-check repair configuration error
*/
static cnvm_state_enum nvmc_cnvm_repair_state_get(void)
{
    cnvm_state_enum cnvm_state = CNVM_REPAIR_READY;

    if(RESET != (NVMC_CNVM_REPCS & NVMC_CNVM_REPCS_REPSTART)) {
        cnvm_state = CNVM_REPAIR_BUSY;
    } else if(RESET != (NVMC_CNVM_REPCS & CNVM_FLAG_REPAIR_ECNVM_BLANK)) {
        cnvm_state = CNVM_REPAIR_ECNVM_BLANK;
    } else if(RESET != (NVMC_CNVM_REPCS & CNVM_FLAG_REPAIR_REPSTRERR)) {
        cnvm_state = CNVM_REPAIR_REPSTRERR;
    } else {
        cnvm_state = CNVM_REPAIR_READY;
    }

    /* return the CNVM state */
    return cnvm_state;
}

/*!
    \brief      check whether CNVM repair is ready or not (API_ID(0x002BU))
    \param[in]  timeout: timeout count (0x00000000 - 0xFFFFFFFF)
    \param[out] none
    \retval     state of CNVM
      \arg        CNVM_REPAIR_READY: CNVM self-repair has been completed
      \arg        CNVM_REPAIR_BUSY: CNVM repair operation is in progress
      \arg        CNVM_REPAIR_ECNVM_BLANK: CNVM ECNVM data integrity enhancement content is blank error
      \arg        CNVM_REPAIR_REPSTRERR: CNVM self-check repair configuration error
      \arg        CNVM_TOERR: CNVM timeout error
    \note       This function contains scenarios leading to an infinite loop.
                Modify according to the user's actual usage scenarios.
*/
static cnvm_state_enum nvmc_cnvm_repair_ready_wait(uint32_t timeout)
{
    cnvm_state_enum cnvm_state = CNVM_REPAIR_BUSY;

    /* wait for CNVM ready */
    do {
        /* insert a tiny gap to avoid over-dense status polling */
        for(uint32_t nop_cnt = 0U; nop_cnt < 40U; nop_cnt++) {
            __NOP();
        }

