RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_nvmc.c
        /* get CNVM state */
        cnvm_state = nvmc_cnvm_repair_state_get();
        timeout--;
    } while((CNVM_REPAIR_BUSY == cnvm_state) && (0U != timeout));

    if(CNVM_REPAIR_BUSY == cnvm_state) {
        cnvm_state = CNVM_TOERR;
    }
    /* return the CNVM state */
    return cnvm_state;
}

/*!
    \brief      unlock register NVMC_ECNVM_CTL (API_ID(0x002CU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_ecnvm_unlock(void)
{
    if((RESET != (NVMC_ECNVM_CTL & NVMC_ECNVM_CTL_LK))) {
        /* write the ecnvm key */
        NVMC_ECNVM_KEY = UNLOCK_KEY0;
        NVMC_ECNVM_KEY = UNLOCK_KEY1;
    }
}

/*!
    \brief      lock register NVMC_ECNVM_CTL (API_ID(0x002DU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_ecnvm_lock(void)
{
    /* set the LK bit*/
    NVMC_ECNVM_CTL |= NVMC_ECNVM_CTL_LK;
}

#ifndef NVM_VER_1_625_AND_0
/*!
    \brief      program a double-word at the corresponding address (API_ID(0x002EU))
    \param[in]  address: address to program (GD32H77XXW/GD32H78XXW: 0x08200000U - 0x0897FFFF, GD32H77XXP/GD32H78XXP:0x08200000U - 0x0857FFFF)
    \param[in]  data: double word to program
    \param[out] none
    \retval     state of ecnvm
      \arg        ECNVM_READY: ecnvm operation has been completed
      \arg        ECNVM_BUSY: ecnvm operation is in progress
      \arg        ECNVM_WPERR: ecnvm erase/program protection error
      \arg        ECNVM_PGSERR: ecnvm program sequence error
      \arg        ECNVM_RPERR: ecnvm read protection error
      \arg        ECNVM_RSERR: ecnvm read secure error
      \arg        ECNVM_TOERR: ecnvm timeout error
*/
ecnvm_state_enum nvmc_ecnvm_doubleword_program(uint32_t address, uint64_t data)
{
    ecnvm_state_enum ecnvm_state = ECNVM_READY;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ECNVM_VALID_ADDRESS(address)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x002EU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        /* wait for the ecnvm ready */
        ecnvm_state = nvmc_ecnvm_ready_wait(ECNVM_TIMEOUT_COUNT);

        if(ECNVM_READY == ecnvm_state) {
            /* set ecnvm program size */
            NVMC_PERFCTL &= ~NVMC_PERFCTL_ECNVM_PG_SZ;
            NVMC_PERFCTL |= ECNVM_PROG_SIZE_8BYTES;
            /* set the PG bit to start program */
            NVMC_ECNVM_CTL |= NVMC_ECNVM_CTL_PG;

            __ISB();
            __DSB();

            /* use explicit doubleword store to guarantee atomic 64-bit write */
            __ASM volatile(
                "strd %Q[data], %R[data], [%[addr]]\n"
                :
                : [addr] "r"(address), [data] "r"(data)
                : "memory");

            /* wait for the ecnvm ready */
            ecnvm_state = _nvmc_ecnvm_ready_wait(ECNVM_TIMEOUT_COUNT);

            __DMB();

            /* reset the PG bit */
            NVMC_ECNVM_CTL &= ~NVMC_ECNVM_CTL_PG;
        }
    }
    /* return the ecnvm state */
    return ecnvm_state;
}

/*!
    \brief      program 32 bytes at the corresponding ecnvm address (API_ID(0x002FU))
    \param[in]  address: address to program (GD32H77XXW/GD32H78XXW: 0x08200000U - 0x0897FFFF, GD32H77XXP/GD32H78XXP:0x08200000U - 0x0857FFFF)
    \param[in]  data: data buffer to program
    \param[out] none
    \retval     state of ecnvm
      \arg        ECNVM_READY: ecnvm operation has been completed
      \arg        ECNVM_BUSY: ecnvm operation is in progress
      \arg        ECNVM_WPERR: ecnvm erase/program protection error
      \arg        ECNVM_PGSERR: ecnvm program sequence error
      \arg        ECNVM_RPERR: ecnvm read protection error
      \arg        ECNVM_RSERR: ecnvm read secure error
      \arg        ECNVM_TOERR: ecnvm timeout error
*/
ecnvm_state_enum nvmc_ecnvm_32bytes_program(uint32_t address, uint64_t data[])
{
    uint32_t index;
    ecnvm_state_enum ecnvm_state = ECNVM_READY;
    uint64_t data_val;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ECNVM_VALID_ADDRESS(address)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x002FU), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_VALID_POINTER(data)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x002FU), ERR_PARAM_POINTER);
    } else
#endif
    {
        /* wait for the ecnvm ready */
        ecnvm_state = nvmc_ecnvm_ready_wait(ECNVM_TIMEOUT_COUNT);

        if(ECNVM_READY == ecnvm_state) {
            /* set ecnvm program size */
            NVMC_PERFCTL &= ~NVMC_PERFCTL_ECNVM_PG_SZ;
            NVMC_PERFCTL |= ECNVM_PROG_SIZE_32BYTES;
            /* set the PG bit to start program */
            NVMC_ECNVM_CTL |= NVMC_ECNVM_CTL_PG;

            __ISB();
            __DSB();

            for(index = 0U; index < 4U; index++) {
                /* use explicit doubleword store to guarantee atomic 64-bit write */
                data_val = data[index];
                __ASM volatile(
                    "strd %Q[data_val], %R[data_val], [%[addr]]\n"
                    :
                    : [addr] "r"(address), [data_val] "r"(data_val)
                    : "memory");
                __DMB();
                address += 8U;
            }

            /* wait for the ecnvm ready */
            ecnvm_state = _nvmc_ecnvm_ready_wait(ECNVM_TIMEOUT_COUNT);

            __ISB();
            __DSB();

            /* reset the PG bit */
            NVMC_ECNVM_CTL &= ~NVMC_ECNVM_CTL_PG;
        }
    }
    /* return the ecnvm state */
    return ecnvm_state;
}

/*!
    \brief      erase page of ecnvm (API_ID(0x0030U))
    \param[in]  address: page address to erase (GD32H77XXW/GD32H78XXW: 0x08200000U - 0x0897FFFF, GD32H77XXP/GD32H78XXP:0x08200000U - 0x0857FFFF)
    \param[out] none
    \retval     state of ecnvm
      \arg        ECNVM_READY: ecnvm operation has been completed
      \arg        ECNVM_BUSY: ecnvm operation is in progress
      \arg        ECNVM_WPERR: ecnvm erase/program protection error
      \arg        ECNVM_PGSERR: ecnvm program sequence error
      \arg        ECNVM_RPERR: ecnvm read protection error
      \arg        ECNVM_RSERR: ecnvm read secure error
      \arg        ECNVM_TOERR: ecnvm timeout error
*/
ecnvm_state_enum nvmc_ecnvm_page_erase(uint32_t address)
{
    ecnvm_state_enum ecnvm_state = ECNVM_READY;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ECNVM_VALID_ADDRESS(address)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0030U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        /* wait for the ecnvm ready */
        ecnvm_state = nvmc_ecnvm_ready_wait(ECNVM_TIMEOUT_COUNT);

        if(ECNVM_READY == ecnvm_state) {
            NVMC_ECNVM_CTL |= NVMC_ECNVM_CTL_PER;
            /* write the page address */
            NVMC_ECNVM_ADDR = address;
            /* start sector erase */
            NVMC_ECNVM_CTL |= NVMC_ECNVM_CTL_START;
            /* wait for the ecnvm ready */
            ecnvm_state = _nvmc_ecnvm_ready_wait(ECNVM_TIMEOUT_COUNT);
            /* reset the SER bit */
            NVMC_ECNVM_CTL &= (~NVMC_ECNVM_CTL_PER);
        }
    }
    /* return the ecnvm state */
    return ecnvm_state;
}

/*!
    \brief      erase sector of ecnvm (API_ID(0x0031U))
    \param[in]  address: sector address to erase (GD32H77XXW/GD32H78XXW: 0x08200000U - 0x0897FFFF, GD32H77XXP/GD32H78XXP:0x08200000U - 0x0857FFFF)
    \param[out] none
    \retval     state of ecnvm
      \arg        ECNVM_READY: ecnvm operation has been completed
      \arg        ECNVM_BUSY: ecnvm operation is in progress
      \arg        ECNVM_WPERR: ecnvm erase/program protection error
      \arg        ECNVM_PGSERR: ecnvm program sequence error
      \arg        ECNVM_RPERR: ecnvm read protection error
      \arg        ECNVM_RSERR: ecnvm read secure error
      \arg        ECNVM_TOERR: ecnvm timeout error
*/
ecnvm_state_enum nvmc_ecnvm_sector_erase(uint32_t address)
{
    ecnvm_state_enum ecnvm_state = ECNVM_READY;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_ECNVM_VALID_ADDRESS(address)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0031U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        /* wait for the ecnvm ready */
        ecnvm_state = nvmc_ecnvm_ready_wait(ECNVM_TIMEOUT_COUNT);

        if(ECNVM_READY == ecnvm_state) {
            NVMC_ECNVM_CTL |= NVMC_ECNVM_CTL_SER;
            /* write the sector address */
            NVMC_ECNVM_ADDR = address;
            /* start sector erase */
            NVMC_ECNVM_CTL |= NVMC_ECNVM_CTL_START;
            /* wait for the ecnvm ready */
            ecnvm_state = _nvmc_ecnvm_ready_wait(ECNVM_TIMEOUT_COUNT);
            /* reset the SER bit */
            NVMC_ECNVM_CTL &= (~NVMC_ECNVM_CTL_SER);
        }
    }
    /* return the ecnvm state */
    return ecnvm_state;
}

/*!
    \brief      erase whole ecnvm (API_ID(0x0032U))
    \param[in]  none
    \param[out] none
    \retval     state of ecnvm
      \arg        ECNVM_READY: ecnvm operation has been completed
      \arg        ECNVM_BUSY: ecnvm operation is in progress
      \arg        ECNVM_WPERR: ecnvm erase/program protection error
      \arg        ECNVM_PGSERR: ecnvm program sequence error
      \arg        ECNVM_RPERR: ecnvm read protection error
      \arg        ECNVM_RSERR: ecnvm read secure error
      \arg        ECNVM_TOERR: ecnvm timeout error
*/
ecnvm_state_enum nvmc_ecnvm_mass_erase(void)
{
    ecnvm_state_enum ecnvm_state = ECNVM_READY;

