RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_nvmc.c
    /* wait for the ecnvm ready */
    ecnvm_state = nvmc_ecnvm_ready_wait(ECNVM_TIMEOUT_COUNT);

    if(ECNVM_READY == ecnvm_state) {
        /* enable mass erase operation */
        NVMC_ECNVM_CTL |= NVMC_ECNVM_CTL_MER;
        /* start whole chip erase */
        NVMC_ECNVM_CTL |= NVMC_ECNVM_CTL_START;
        /* wait for the ecnvm ready */
        ecnvm_state = _nvmc_ecnvm_ready_wait(ECNVM_TIMEOUT_COUNT);
        /* reset the MER bit */
        NVMC_ECNVM_CTL &= ~NVMC_ECNVM_CTL_MER;
    }

    /* return the ecnvm state */
    return ecnvm_state;
}
#endif /* NVM_VER_1_625_AND_0 */

/*!
   \brief      get ecnvm flag set or reset (API_ID(0x0033U))
   \param[in]  ecnvm_flag: check ecnvm flag
               only one parameter can be selected which is shown as below:
     \arg        ECNVM_FLAG_BUSY: ecnvm busy flag
     \arg        ECNVM_FLAG_ENDF: ecnvm end of operation flag
     \arg        ECNVM_FLAG_WPERR: ecnvm write protection error flag
     \arg        ECNVM_FLAG_PGSERR: ecnvm program sequence error flag
     \arg        ECNVM_FLAG_RPERR: ecnvm read protection error flag
     \arg        ECNVM_FLAG_RSERR: ecnvm read secure error flag
     \arg        ECNVM_FLAG_ECCDET: ecnvm two bits detect error flag
   \param[out] none
   \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ecnvm_flag_get(uint32_t ecnvm_flag)
{
    FlagStatus flag = RESET;

    if(NVMC_ECNVM_STAT & ecnvm_flag) {
        flag = SET;
    }
    /* return the state of corresponding ecnvm flag */
    return flag;
}

/*!
    \brief      clear the ecnvm pending flag (API_ID(0x0034U))
    \param[in]  ecnvm_flag: clear ecnvm flag
                one or more parameters can be selected which is shown as below:
      \arg        ECNVM_FLAG_ENDF: ecnvm end of operation flag
      \arg        ECNVM_FLAG_WPERR: ecnvm write protection error flag
      \arg        ECNVM_FLAG_PGSERR: ecnvm program sequence error flag
      \arg        ECNVM_FLAG_RPERR: ecnvm read protection error flag
      \arg        ECNVM_FLAG_RSERR: ecnvm read secure error flag
      \arg        ECNVM_FLAG_ECCDET: ecnvm two bits detect error flag
    \param[out] none
    \retval     none
*/
void nvmc_ecnvm_flag_clear(uint32_t ecnvm_flag)
{
    /* clear the flags */
    NVMC_ECNVM_STAT = ecnvm_flag;
}

/*!
    \brief      enable ecnvm interrupt (API_ID(0x0035U))
    \param[in]  ecnvm_int: the ecnvm interrupt source
                one or more parameters can be selected which is shown as below:
      \arg        ECNVM_INT_ENDIE: ecnvm end of program interrupt
      \arg        ECNVM_INT_WPERRIE: write protection error interrupt
      \arg        ECNVM_INT_PGSERRIE: program sequence error interrupt
      \arg        ECNVM_INT_RPERRIE: read protection error interrupt
      \arg        ECNVM_INT_RSERRIE: read secure error interrupt
      \arg        ECNVM_INT_ECCDETIE: two bits detect error interrupt
    \param[out] none
    \retval     none
*/
void nvmc_ecnvm_interrupt_enable(uint32_t ecnvm_int)
{
    NVMC_ECNVM_CTL |= ecnvm_int;
}

/*!
    \brief      disable ecnvm interrupt (API_ID(0x0036U))
    \param[in]  ecnvm_int: the ecnvm interrupt source
                one or more parameters can be selected which is shown as below:
      \arg        ECNVM_INT_ENDIE: end of program interrupt
      \arg        ECNVM_INT_WPERRIE: write protection error interrupt
      \arg        ECNVM_INT_PGSERRIE: program sequence error interrupt
      \arg        ECNVM_INT_RPERRIE: read protection error interrupt
      \arg        ECNVM_INT_RSERRIE: secure error interrupt
      \arg        ECNVM_INT_ECCDETIE: two bits detect error interrupt
    \param[out] none
    \retval     none
*/
void nvmc_ecnvm_interrupt_disable(uint32_t ecnvm_int)
{
    NVMC_ECNVM_CTL &= ~(uint32_t)ecnvm_int;
}

/*!
    \brief      get ecnvm interrupt flag status (API_ID(0x0037U))
    \param[in]  ecnvm_int_flag: ecnvm interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        ECNVM_INT_FLAG_ENDF: ecnvm end of operation interrupt flag
      \arg        ECNVM_INT_FLAG_WPERR: ecnvm write protection error interrupt flag
      \arg        ECNVM_INT_FLAG_PGSERR: ecnvm program sequence error interrupt flag
      \arg        ECNVM_INT_FLAG_RPERR: ecnvm read protection error interrupt flag
      \arg        ECNVM_INT_FLAG_RSERR: ecnvm read secure error interrupt flag
      \arg        ECNVM_INT_FLAG_ECCDET: ecnvm two bits detect error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ecnvm_interrupt_flag_get(uint8_t ecnvm_int_flag)
{
    FlagStatus reval = RESET;

    uint32_t reg1 = NVMC_ECNVM_STAT;
    uint32_t reg2 = NVMC_ECNVM_CTL;

    switch(ecnvm_int_flag) {
    /* ecnvm end of operation interrupt */
    case ECNVM_INT_FLAG_ENDF:
        reg1 = reg1 & NVMC_ECNVM_STAT_ENDF;
        reg2 = reg2 & NVMC_ECNVM_CTL_ENDIE;
        break;
    /* ecnvm write protection error interrupt */
    case ECNVM_INT_FLAG_WPERR:
        reg1 = reg1 & NVMC_ECNVM_STAT_WPERR;
        reg2 = reg2 & NVMC_ECNVM_CTL_WPERRIE;
        break;
    /* ecnvm program sequence error interrupt */
    case ECNVM_INT_FLAG_PGSERR:
        reg1 = reg1 & NVMC_ECNVM_STAT_PGSERR;
        reg2 = reg2 & NVMC_ECNVM_CTL_PGSERRIE;
        break;
    /* ecnvm read protection error interrupt */
    case ECNVM_INT_FLAG_RPERR:
        reg1 = reg1 & NVMC_ECNVM_STAT_RPERR;
        reg2 = reg2 & NVMC_ECNVM_CTL_RPERRIE;
        break;
    /* ecnvm read secure error interrupt */
    case ECNVM_INT_FLAG_RSERR:
        reg1 = reg1 & NVMC_ECNVM_STAT_RSERR;
        reg2 = reg2 & NVMC_ECNVM_CTL_RSERRIE;
        break;
    /* ecnvm two bits detect error interrupt */
    case ECNVM_INT_FLAG_ECCDET:
        reg1 = reg1 & NVMC_ECNVM_STAT_ECCDET;
        reg2 = reg2 & NVMC_ECNVM_CTL_ECCDETIE;
        break;
    default :
        break;
    }
    /*get ecnvm interrupt flag status */
    if((0U != reg1) && (0U != reg2)) {
        reval = SET;
    }

    return reval;
}

/*!
    \brief      clear ecnvm interrupt flag status (API_ID(0x0038U))
    \param[in]  ecnvm_int_flag: ecnvm interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        ECNVM_INT_FLAG_ENDF: ecnvm end of operation interrupt flag
      \arg        ECNVM_INT_FLAG_WPERR: ecnvm write protection error interrupt flag
      \arg        ECNVM_INT_FLAG_PGSERR: ecnvm program sequence error interrupt flag
      \arg        ECNVM_INT_FLAG_RPERR: ecnvm read protection error interrupt flag
      \arg        ECNVM_INT_FLAG_RSERR: ecnvm read secure error interrupt flag
      \arg        ECNVM_INT_FLAG_ECCDET: ecnvm two bits detect error interrupt flag
    \param[out] none
    \retval     none
*/
void nvmc_ecnvm_interrupt_flag_clear(uint8_t ecnvm_int_flag)
{

    switch(ecnvm_int_flag) {
    /* ecnvm end of operation interrupt */
    case ECNVM_INT_FLAG_ENDF:
        NVMC_ECNVM_STAT |= NVMC_ECNVM_STAT_ENDF;
        break;
    /* ecnvm write protection error interrupt */
    case ECNVM_INT_FLAG_WPERR:
        NVMC_ECNVM_STAT |= NVMC_ECNVM_STAT_WPERR;
        break;
    /* ecnvm program sequence error interrupt */
    case ECNVM_INT_FLAG_PGSERR:
        NVMC_ECNVM_STAT |= NVMC_ECNVM_STAT_PGSERR;
        break;
    /* ecnvm read protection error interrupt */
    case ECNVM_INT_FLAG_RPERR:
        NVMC_ECNVM_STAT |= NVMC_ECNVM_STAT_RPERR;
        break;
    /* ecnvm read secure error interrupt */
    case ECNVM_INT_FLAG_RSERR:
        NVMC_ECNVM_STAT |= NVMC_ECNVM_STAT_RSERR;
        break;
    /* ecnvm two bits detect error interrupt */
    case ECNVM_INT_FLAG_ECCDET:
        NVMC_ECNVM_STAT |= NVMC_ECNVM_STAT_ECCDET;
        break;
    default :
        break;
    }

