RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_nvmc.c
}

/*!
    \brief      get the ecnvm state (API_ID(0x0039U))
    \param[in]  none
    \param[out] none
    \retval     state of ecnvm
      \arg        ECNVM_READY: ecnvm operation has been completed
      \arg        ECNVM_BUSY: ecnvm operation is in progress
      \arg        ECNVM_WPERR: ecnvm erase/program protection error
      \arg        ECNVM_PGSERR: ecnvm program sequence error
      \arg        ECNVM_RPERR: ecnvm read protection error
      \arg        ECNVM_RSERR: ecnvm read secure error
*/
static ecnvm_state_enum nvmc_ecnvm_state_get(void)
{
    ecnvm_state_enum ecnvm_state = ECNVM_READY;

    if(ECNVM_FLAG_BUSY == (NVMC_ECNVM_STAT & ECNVM_FLAG_BUSY)) {
        ecnvm_state = ECNVM_BUSY;
    } else if(RESET != (NVMC_ECNVM_STAT & ECNVM_FLAG_WPERR)) {
        ecnvm_state = ECNVM_WPERR;
    } else if(RESET != (NVMC_ECNVM_STAT & ECNVM_FLAG_RSERR)) {
        ecnvm_state = ECNVM_RSERR;
    } else if(RESET != (NVMC_ECNVM_STAT & ECNVM_FLAG_RPERR)) {
        ecnvm_state = ECNVM_RPERR;
    } else if(RESET != (NVMC_ECNVM_STAT & ECNVM_FLAG_PGSERR)) {
        ecnvm_state = ECNVM_PGSERR;
    } else {
        ecnvm_state = ECNVM_READY;
    }

    /* return the ecnvm state */
    return ecnvm_state;
}

/*!
    \brief      check whether ecnvm is ready or not (API_ID(0x003AU))
    \param[in]  timeout: timeout count (0x00000000 - 0xFFFFFFFF)
    \param[out] none
    \retval     state of ecnvm
      \arg        ECNVM_READY: ecnvm operation has been completed
      \arg        ECNVM_BUSY: ecnvm operation is in progress
      \arg        ECNVM_WPERR: ecnvm erase/program protection error
      \arg        ECNVM_PGSERR: ecnvm program sequence error
      \arg        ECNVM_RPERR: ecnvm read protection error
      \arg        ECNVM_RSERR: ecnvm read secure error
      \arg        ECNVM_TOERR: ecnvm timeout error
    \note       This function contains scenarios leading to an infinite loop.
                Modify according to the user's actual usage scenarios.
*/
static ecnvm_state_enum nvmc_ecnvm_ready_wait(uint32_t timeout)
{
    ecnvm_state_enum ecnvm_state = ECNVM_BUSY;

    /* wait for ecnvm ready */
    do {
        /* get ecnvm state */
        ecnvm_state = nvmc_ecnvm_state_get();
        timeout--;
    } while((ECNVM_BUSY == ecnvm_state) && (0U != timeout));

    if(ECNVM_BUSY == ecnvm_state) {
        ecnvm_state = ECNVM_TOERR;
    }
    /* return the ecnvm state */
    return ecnvm_state;
}

/*!
    \brief      check whether ecnvm is ready or not (API_ID(0x003BU))
    \param[in]  timeout: timeout count (0x00000000 - 0xFFFFFFFF)
    \param[out] none
    \retval     state of ecnvm
      \arg        ECNVM_READY: ecnvm operation has been completed
      \arg        ECNVM_BUSY: ecnvm operation is in progress
      \arg        ECNVM_WPERR: ecnvm erase/program protection error
      \arg        ECNVM_PGSERR: ecnvm program sequence error
      \arg        ECNVM_RPERR: ecnvm read protection error
      \arg        ECNVM_RSERR: ecnvm read secure error
      \arg        ECNVM_TOERR: ecnvm timeout error
    \note       This function contains scenarios leading to an infinite loop.
                Modify according to the user's actual usage scenarios.
*/
static ecnvm_state_enum _nvmc_ecnvm_ready_wait(uint32_t timeout)
{
    ecnvm_state_enum ecnvm_state = ECNVM_BUSY;
    volatile uint32_t wait_busy_timeout = 0U;

    while(wait_busy_timeout < 0xFFU) {
        if((NVMC_ECNVM_STAT & ECNVM_FLAG_BUSY) != 0U) {
            break;
        }
        wait_busy_timeout++;
    }

    /* wait for ecnvm ready */
    do {
        /* get ecnvm state */
        ecnvm_state = nvmc_ecnvm_state_get();
        timeout--;
    } while((ECNVM_BUSY == ecnvm_state) && (0U != timeout));

    if(ECNVM_BUSY == ecnvm_state) {
        ecnvm_state = ECNVM_TOERR;
    }
    /* return the ecnvm state */
    return ecnvm_state;
}

/*!
    \brief      program a half-word at the OTP corresponding address (API_ID(0x003CU))
    \param[in]  address: address to program (0x1FFF0000 + 0x20 * x (x = 0 ... 207))
    \param[in]  data: half-word to program
    \param[out] none
    \retval     state of OTP
      \arg        OTP_READY: OTP operation has been completed
      \arg        OTP_BUSY: OTP operation is in progress
      \arg        OTP_DATAERR: OTP Data error
      \arg        OTP_PGLKERR: OTP Program at lock state error
      \arg        OTP_MULTI_DATAERR: OTP Multi-redundant data error
      \arg        OTP_PGSERR: OTP program sequence error
      \arg        OTP_TOERR: OTP timeout error
*/
otp_state_enum nvmc_otp_halfword_program(uint32_t address, uint16_t data)
{
    otp_state_enum otp_state = OTP_READY;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_OTP_VALID_ADDRESS(address)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x003CU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        /* wait for the OTP ready */
        otp_state = nvmc_otp_ready_wait(OTP_TIMEOUT_COUNT);

        if(OTP_READY == otp_state) {
            NVMC_CNVM_CTL |= NVMC_CNVM_CTL_PG;
            REG16(address) = data;
            __DSB();
            otp_state = nvmc_otp_ready_wait(OTP_TIMEOUT_COUNT);
            NVMC_CNVM_CTL &= ~NVMC_CNVM_CTL_PG;
        }
    }
    return otp_state;
}

/*!
    \brief     program all AES KEY parameter (API_ID(0x003DU))
    \param[in]  buf: data buffer to write
    \param[out] none
    \retval     state of OTP
      \arg        OTP_READY: OTP operation has been completed
      \arg        OTP_BUSY: OTP operation is in progress
      \arg        OTP_DATAERR: OTP Data error
      \arg        OTP_PGLKERR: OTP Program at lock state error
      \arg        OTP_MULTI_DATAERR: OTP Multi-redundant data error
      \arg        OTP_PGSERR: OTP program sequence error
      \arg        OTP_TOERR: OTP timeout error
*/
otp_state_enum nvmc_otp_aes_key_all_program(uint16_t buf[])
{
    uint32_t index;
    uint32_t OTP_HALFWORD_CNT = (uint32_t)AES_KEY_SIZE / 2U;
    otp_state_enum otp_state = OTP_READY;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(buf)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x003DU), ERR_PARAM_POINTER);
    } else
#endif
    {
        for(index = 0U; index < OTP_HALFWORD_CNT; index++) {
            nvmc_otp_flag_clear(OTP_FLAG_ENDF | OTP_FLAG_DATAERR | OTP_FLAG_PGLKERR | OTP_FLAG_PGSERR | OTP_FLAG_MULTI_DATAERR);
            otp_state = nvmc_otp_halfword_program(OTP_AES_KEY_AXI_ADDR + index * 0x20U, buf[index]);
            if(OTP_READY != otp_state) {
                break;
            }
        }
    }

    return otp_state;
}

/*!
    \brief      program all debug password parameter (API_ID(0x003EU))
    \param[in]  buf: data buffer to write
    \param[out] none
    \retval     state of OTP
      \arg        OTP_READY: OTP operation has been completed
      \arg        OTP_BUSY: OTP operation is in progress
      \arg        OTP_DATAERR: OTP Data error
      \arg        OTP_PGLKERR: OTP Program at lock state error
      \arg        OTP_MULTI_DATAERR: OTP Multi-redundant data error
      \arg        OTP_PGSERR: OTP program sequence error
      \arg        OTP_TOERR: OTP timeout error
*/
otp_state_enum nvmc_otp_dp_all_program(uint16_t buf[])
{
    uint32_t index;
    uint32_t OTP_HALFWORD_CNT = (uint32_t)USER_DP_SIZE / 2U;
    otp_state_enum otp_state = OTP_READY;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(buf)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x003EU), ERR_PARAM_POINTER);
    } else
#endif
    {
        for(index = 0U; index < OTP_HALFWORD_CNT; index++) {
            nvmc_otp_flag_clear(OTP_FLAG_ENDF | OTP_FLAG_DATAERR | OTP_FLAG_PGLKERR | OTP_FLAG_PGSERR | OTP_FLAG_MULTI_DATAERR);
            otp_state = nvmc_otp_halfword_program(OTP_USER_DBGPSWD_DATA_AXI_ADDR + index * 0x20U, buf[index]);
            if(OTP_READY != otp_state) {
                break;
            }
        }
    }
    return otp_state;
}

/*!
    \brief      program all user data parameter (API_ID(0x003FU))
    \param[in]  buf: data buffer to write
    \param[out] none
    \retval     state of OTP
      \arg        OTP_READY: OTP operation has been completed
      \arg        OTP_BUSY: OTP operation is in progress
      \arg        OTP_DATAERR: OTP Data error
      \arg        OTP_PGLKERR: OTP Program at lock state error
      \arg        OTP_MULTI_DATAERR: OTP Multi-redundant data error
      \arg        OTP_PGSERR: OTP program sequence error
      \arg        OTP_TOERR: OTP timeout error
*/
otp_state_enum nvmc_otp_user_data_all_program(uint16_t buf[])
{
    uint32_t index;
    uint32_t OTP_HALFWORD_CNT = (uint32_t)USER_DATA_SIZE / 2U;
    otp_state_enum otp_state = OTP_READY;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(buf)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x003FU), ERR_PARAM_POINTER);
    } else
#endif
    {
        for(index = 0U; index < OTP_HALFWORD_CNT; index++) {
            nvmc_otp_flag_clear(OTP_FLAG_ENDF | OTP_FLAG_DATAERR | OTP_FLAG_PGLKERR | OTP_FLAG_PGSERR | OTP_FLAG_MULTI_DATAERR);
            otp_state = nvmc_otp_halfword_program(OTP_USER_DATA_AXI_ADDR + index * 0x20U, buf[index]);
            if(OTP_READY != otp_state) {
                break;
            }
        }
    }
    return otp_state;
}

/*!
    \brief      repair OTP data (API_ID(0x0040U))
    \param[in]  none
    \param[out] none
    \retval     state of OTP
      \arg        OTP_READY: OTP operation has been completed
      \arg        OTP_TOERR: OTP timeout error
    \note       This function contains scenarios leading to an infinite loop.
                Modify according to the user's actual usage scenarios.
*/
otp_state_enum nvmc_otp_repair(void)
{
    uint32_t timeout = OTP_TIMEOUT_COUNT;
    otp_state_enum otp_state = OTP_READY;

    /* wait for the OTP ready */
    otp_state = nvmc_otp_ready_wait(OTP_TIMEOUT_COUNT);

    if(OTP_READY == otp_state) {
        NVMC_OTP_CTL |= NVMC_OTP_CTL_OTP_REPSTART;

