RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_nvmc.c
        /* wait for OTP repair ready */
        do {
            /* get OTP state */
            if(OTP_FLAG_BUSY == (NVMC_OTP_STAT & NVMC_OTP_STAT_BUSY)) {
                otp_state = OTP_BUSY;
            } else if(RESET != (NVMC_OTP_STAT & NVMC_OTP_STAT_ENDF)) {
                otp_state = OTP_READY;
                break;
            } else {
                /* should not be here */
            }
            timeout--;
        } while(0U != timeout);

        if(OTP_BUSY == otp_state) {
            otp_state = OTP_TOERR;
        }
    }

    return otp_state;
}

/*!
    \brief      get OTP flag set or reset (API_ID(0x0041U))
    \param[in]  otp_flag: check OTP flag
                only one parameter can be selected which is shown as below:
      \arg        OTP_FLAG_BUSY: OTP busy flag
      \arg        OTP_FLAG_ENDF: OTP end of operation flag
      \arg        OTP_FLAG_DATAERR: OTP Data error flag
      \arg        OTP_FLAG_PGLKERR: OTP Program at lock state error flag
      \arg        OTP_FLAG_PGSERR: OTP program sequence error flag
      \arg        OTP_FLAG_MULTI_DATAERR: OTP Multi-redundant data error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_otp_flag_get(uint32_t otp_flag)
{
    FlagStatus flag = RESET;

    if(NVMC_OTP_STAT & (uint32_t)otp_flag) {
        flag = SET;
    }
    /* return the state of corresponding OTP flag */
    return flag;
}

/*!
    \brief      clear OTP flag (API_ID(0x0042U))
    \param[in]  otp_flag: check OTP flag
                one or more parameters can be selected which is shown as below:
      \arg        OTP_FLAG_ENDF: OTP end of operation flag
      \arg        OTP_FLAG_DATAERR: OTP Data error flag
      \arg        OTP_FLAG_PGLKERR: OTP Program at lock state error flag
      \arg        OTP_FLAG_PGSERR: OTP program sequence error flag
      \arg        OTP_FLAG_MULTI_DATAERR: OTP Multi-redundant data error flag
    \param[out] none
    \retval     none
*/
void nvmc_otp_flag_clear(uint32_t otp_flag)
{
    /* clear the flags */
    NVMC_OTP_STAT = (uint32_t)otp_flag;
}

/*!
    \brief      enable OTP interrupt (API_ID(0x0043U))
    \param[in]  otp_int: the OTP interrupt source
                one or more parameters can be selected which is shown as below:
      \arg        OTP_INT_ENDIE: OTP program/repair end interrupt enable bit
      \arg        OTP_INT_DATAERRIE: OTP Data error interrupt enable bit
      \arg        OTP_INT_PGLKERRIE: OTP Program at lock state error interrupt enable bit
      \arg        OTP_INT_PGSERRIE: OTP program sequence error enable bit
      \arg        OTP_INT_MULTI_DATAERRIE: OTP Multi-redundant data error interrupt enable bit
    \param[out] none
    \retval     none
*/
void nvmc_otp_interrupt_enable(uint32_t otp_int)
{
    NVMC_OTP_CTL |= (uint32_t)otp_int;
}

/*!
    \brief      disable OTP interrupt (API_ID(0x0044U))
    \param[in]  otp_int: the OTP interrupt source
                one or more parameters can be selected which is shown as below:
      \arg        OTP_INT_ENDIE: OTP program/repair end interrupt enable bit
      \arg        OTP_INT_DATAERRIE: OTP Data error interrupt enable bit
      \arg        OTP_INT_PGLKERRIE: OTP Program at lock state error interrupt enable bit
      \arg        OTP_INT_PGSERRIE: OTP program sequence error enable bit
      \arg        OTP_INT_MULTI_DATAERRIE: OTP Multi-redundant data error interrupt enable bit
    \param[out] none
    \retval     none
*/
void nvmc_otp_interrupt_disable(uint32_t otp_int)
{
    NVMC_OTP_CTL &= ~(uint32_t)otp_int;
}

/*!
    \brief      get OTP interrupt flag status (API_ID(0x0045U))
    \param[in]  otp_int_flag: OTP interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        OTP_INT_FLAG_ENDF: OTP end of operation interrupt flag
      \arg        OTP_INT_FLAG_DATAERR: OTP data error interrupt flag
      \arg        OTP_INT_FLAG_PGLKERR: OTP program at lock state error interrupt flag
      \arg        OTP_INT_FLAG_PGSERR: OTP program sequence error interrupt flag
      \arg        OTP_INT_FLAG_MULTI_DATAERR: OTP multi-redundant data error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_otp_interrupt_flag_get(uint8_t otp_int_flag)
{
    FlagStatus reval = RESET;

    uint32_t reg1 = NVMC_OTP_STAT;
    uint32_t reg2 = NVMC_OTP_CTL;

    switch(otp_int_flag) {
    /* OTP end of operation interrupt */
    case OTP_INT_FLAG_ENDF:
        reg1 = reg1 & NVMC_OTP_STAT_ENDF;
        reg2 = reg2 & NVMC_OTP_CTL_ENDIE;
        break;
    /* OTP data error interrupt */
    case OTP_INT_FLAG_DATAERR:
        reg1 = reg1 & NVMC_OTP_STAT_DATAERRF;
        reg2 = reg2 & NVMC_OTP_CTL_DATAERRIE;
        break;
    /* OTP program at lock state error interrupt */
    case OTP_INT_FLAG_PGLKERR:
        reg1 = reg1 & NVMC_OTP_STAT_PGLKERRF;
        reg2 = reg2 & NVMC_OTP_CTL_PGLKERRIE;
        break;
    /* OTP program sequence error interrupt */
    case OTP_INT_FLAG_PGSERR:
        reg1 = reg1 & NVMC_OTP_STAT_PGSERR;
        reg2 = reg2 & NVMC_OTP_CTL_PGSERRIE;
        break;
    /* OTP multi-redundant data error interrupt */
    case OTP_INT_FLAG_MULTI_DATAERR:
        reg1 = reg1 & NVMC_OTP_STAT_MULTI_DATAERRF;
        reg2 = reg2 & NVMC_OTP_CTL_MULTI_DATAERRIE;
        break;
    default :
        break;
    }
    /*get OTP interrupt flag status */
    if((0U != reg1) && (0U != reg2)) {
        reval = SET;
    }

    return reval;
}

/*!
    \brief      clear OTP interrupt flag status (API_ID(0x0046U))
    \param[in]  otp_int_flag: OTP interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        OTP_INT_FLAG_ENDF: OTP end of operation interrupt flag
      \arg        OTP_INT_FLAG_DATAERR: OTP data error interrupt flag
      \arg        OTP_INT_FLAG_PGLKERR: OTP program at lock state error interrupt flag
      \arg        OTP_INT_FLAG_PGSERR: OTP program sequence error interrupt flag
      \arg        OTP_INT_FLAG_MULTI_DATAERR: OTP multi-redundant data error interrupt flag
    \param[out] none
    \retval     none
*/
void nvmc_otp_interrupt_flag_clear(uint8_t otp_int_flag)
{

    switch(otp_int_flag) {
    /* OTP end of operation interrupt */
    case OTP_INT_FLAG_ENDF:
        NVMC_OTP_STAT |= NVMC_OTP_STAT_ENDF;
        break;
    /* OTP data error interrupt */
    case OTP_INT_FLAG_DATAERR:
        NVMC_OTP_STAT |= NVMC_OTP_STAT_DATAERRF;
        break;
    /* OTP program at lock state error interrupt */
    case OTP_INT_FLAG_PGLKERR:
        NVMC_OTP_STAT |= NVMC_OTP_STAT_PGLKERRF;
        break;
    /* OTP program sequence error interrupt */
    case OTP_INT_FLAG_PGSERR:
        NVMC_OTP_STAT |= NVMC_OTP_STAT_PGSERR;
        break;
    /* OTP multi-redundant data error interrupt */
    case OTP_INT_FLAG_MULTI_DATAERR:
        NVMC_OTP_STAT |= NVMC_OTP_STAT_MULTI_DATAERRF;
        break;
    default :
        break;
    }

