RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_nvmc.c
    }
    return nvmc_ob_state;
}

/*!
    \brief      program the option bytes OBSTAT0 (API_ID(0x004DU))
    \param[in]  ob_obstat0: obstat0 option bytes. When write one parameter, the corresponding mask should be set.
                one or more parameters can be selected which are shown as below:
      \arg        OB_LICENCE_FW_INSTALL_ENABLE/OB_LICENCE_FW_INSTALL_DISABLE: Enable/disable icensed firmware install
      \arg        OB_INFO_PRINT_ENABLE/OB_INFO_PRINT_DISABLE: Enable/disable information print during secure boot
      \arg        OB_BOR_TH_VALUE3/OB_BOR_TH_VALUE2/OB_BOR_TH_VALUE1/OB_BOR_TH_OFF: BOR threshold value
      \arg        OB_FWDGT_HW/OB_FWDGT_SW: hardware or software free watchdog timer
      \arg        OB_FW_IMAGE_VERIFICATION_DISABLE/OB_FW_IMAGE_VERIFICATION_ENABLE: Firmware image verification
      \arg        OB_DEEPSLEEP_RST/OB_DEEPSLEEP_NRST: reset or not entering deep sleep mode
      \arg        OB_STDBY_RST/OB_STDBY_NRST: reset or not entering standby mode
      \arg        OB_NSPC/OB_LSPC/OB_HSPC: no protection/protection level low/protection level high
      \arg        OB_OTA_CHECK_DISABLE/OB_OTA_CHECK_ENABLE: disable/enable firmware check
      \arg        OB_DPSLP_FWDGT_SUSPEND/OB_DPSLP_FWDGT_RUN: free watchdog is suspended or running in deep-sleep mode
      \arg        OB_STDBY_FWDGT_SUSPEND/OB_STDBY_FWDGT_RUN: free watchdog is suspended or running in standby mode
      \arg        OB_FW_UPDATE_DISABLE/OB_FW_UPDATE_ENABLE: disable/enable hardware copies ecnvm data integrity enhancement data to CNVM
      \arg        OB_CNVM_BANK0_DATA_INTEGRITY_ENHANCE/OB_CNVM_BANK1_DATA_INTEGRITY_ENHANCE: CNVM content is consistent with ecnvm data integrity enhancement bank0/bank1
      \arg        OB_SECURE_MODE_DISABLE/OB_SECURE_MODE_ENABLE: secure mode disable/enable
      \arg        OB_ITCM_ECC_DISABLE/OB_ITCM_ECC_ENABLE: disable/enable CPU ITCM ECC function
      \arg        OB_DTCM0_ECC_DISABLE/OB_DTCM0_ECC_ENABLE: disable/enable CPU DTCM0 ECC function
      \arg        OB_DTCM1_ECC_DISABLE/OB_DTCM1_ECC_ENABLE: disable/enable CPU DTCM1 ECC function
      \arg        OB_R2_SRAM_ECC_DISABLE/OB_R2_SRAM_ECC_ENABLE: disable/enable Region 2 SRAM ECC function
      \arg        OB_R1_SRAM_ECC_DISABLE/OB_R1_SRAM_ECC_ENABLE: disable/enable Region 1 SRAM ECC function
      \arg        OB_R0_SRAM_ECC_DISABLE/OB_R0_SRAM_ECC_ENABLE: disable/enable Region 0 SRAM ECC function
      \arg        OB_CNVM_ECC_CONTROL_BY_CNVM_ECC_MODE/OB_CNVM_ECC_ENABLE: disable/enable CNVM ECC function
      \arg        OB_IOSPDOPEN_DISABLE/OB_IOSPDOPEN_ENABLE: high-speed at low-voltage disable/enable
      \arg        OB_TIMING_FRIENDLY_MODE/OB_PERFORMANCE_FRIENDLY_MODE: Timing friendly mode/Performance-first mode
      \arg        OB_FIRMWARE_IMG_VERIFY_DISABLE/OB_FIRMWARE_IMG_VERIFY_ENABLE: firmware image verification disable/enable
    \param[in]  ob_obstat0_mask: obstat0 bits mask. They correspond to the above parameter value one by one.
                one or more parameters can be selected which are shown as below:
      \arg        NVMC_OBSTAT0_MDF_DISLFI: Licensed firmware install (LFI) disable bit mask
      \arg        NVMC_OBSTAT0_MDF_NOPRINT: no information is printed during secure boot mask
      \arg        NVMC_OBSTAT0_MDF_BOR_TH: brownout reset threshold value mask
      \arg        NVMC_OBSTAT0_MDF_NWDG_HW: watchdog value mask
      \arg        NVMC_OBSTAT0_MDF_VFALL: Firmware image verification enable bit mask
      \arg        NVMC_OBSTAT0_MDF_NRST_DPSLP: deepsleep reset value mask
      \arg        NVMC_OBSTAT0_MDF_NRST_STDBY: standby reset value mask
      \arg        NVMC_OBSTAT0_MDF_SPC: security protection code mask
      \arg        NVMC_OBSTAT0_MDF_OTA_CHECK: OTA check status bit mask
      \arg        NVMC_OBSTAT0_MDF_FWDGSPD_DPSLP: watchdog suspend status in deepsleep mode mask
      \arg        NVMC_OBSTAT0_MDF_FWDGSPD_STDBY: watchdog suspend status in standby mode mask
      \arg        NVMC_OBSTAT0_MDF_FW_UPDATE: Firmware update status bit mask
      \arg        NVMC_OBSTAT0_MDF_SWAP: SWAP status bit mask
      \arg        NVMC_OBSTAT0_MDF_SCR: security access mode status bit mask
      \arg        NVMC_OBSTAT0_MDF_ITCMECCEN: ITCM ECC function enable status bit mask
      \arg        NVMC_OBSTAT0_MDF_DTCM0ECCEN: DTCM0 ECC function enable status bit mask
      \arg        NVMC_OBSTAT0_MDF_DTCM1ECCEN: DTCM1 ECC function enable status bit mask
      \arg        NVMC_OBSTAT0_MDF_R2_SRAM_ECCEN: Region 2 SRAM ECC enable status bit mask
      \arg        NVMC_OBSTAT0_MDF_R1_SRAM_ECCEN: Region 1 SRAM ECC enable status bit mask
      \arg        NVMC_OBSTAT0_MDF_R0_SRAM_ECCEN: Region 0 SRAM ECC enable status bit mask
      \arg        NVMC_OBSTAT0_MDF_CNVM_ECC_OVRD: CNVM ECC enable status bit mask
      \arg        NVMC_OBSTAT0_MDF_IOSPDOPEN: I/O speed optimization, high-speed at low-voltage enable status bit mask
      \arg        NVMC_OBSTAT0_MDF_NOPIPE_MODE: pipeline mode bit mask
      \arg        NVMC_OBSTAT0_MDF_VFIMG: Firmware image verification enable bit mask
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_obstat0_config(uint32_t ob_obstat0, uint32_t ob_obstat0_mask)
{
    uint32_t obstat0_reg;
    uint32_t obstat0_eft_spc = NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_SPC;
    uint32_t otp_user_ctl0_spc_h = NVMC_OTP_USER_CTL0 & NVMC_OTP_USER_CTL0_SPC_H;
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    /* check the option bytes security protection value */
    if((OB_HSPC == obstat0_eft_spc) || otp_user_ctl0_spc_h) {
        nvmc_ob_state = NVMC_HSPC;
    } else {
        /* wait for the nvmc ready */
        nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);

        if(NVMC_OB_READY == nvmc_ob_state) {
            obstat0_reg = NVMC_OBSTAT0_EFT;

            NVMC_OBSTAT0_MDF = (obstat0_reg & (~ob_obstat0_mask)) | (ob_obstat0 & ob_obstat0_mask);
            /* set the OBSTART bit */
            NVMC_OBCTL |= NVMC_OBCTL_OBSTART;
            /* wait for the nvmc ready */
            nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);
        }
    }
    return nvmc_ob_state;
}

/*!
    \brief      enable secure access mode (API_ID(0x004EU))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_secure_access_mode_enable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_obstat0_config(OB_SECURE_MODE_ENABLE, NVMC_OBSTAT0_MDF_SCR);

    return nvmc_ob_state;
}

/*!
    \brief      disable secure access mode (API_ID(0x004FU))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_secure_access_mode_disable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_obstat0_config(OB_SECURE_MODE_DISABLE, NVMC_OBSTAT0_MDF_SCR);

    return nvmc_ob_state;
}

/*!
    \brief      configure the option byte security protection level (API_ID(0x0050U))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  ob_spc: specify security protection level
                only one parameter can be selected which is shown as below:
      \arg        OB_NSPC: no read protection
      \arg        OB_LSPC: low read protection
      \arg        OB_HSPC: high read protection
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_security_protection_config(uint32_t ob_spc)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_NVMC_SPC_VALUE(ob_spc)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0050U), ERR_PARAM_INVALID);
    } else
#endif
    {
        nvmc_ob_state = nvmc_ob_obstat0_config(ob_spc, NVMC_OBSTAT0_MDF_SPC);
    }
    return nvmc_ob_state;
}

/*!
    \brief      program low power related option byte configuration (API_ID(0x0051U))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  ob_deepsleep: option byte deepsleep reset value
                only one parameter can be selected which is shown as below:
      \arg        OB_DEEPSLEEP_NRST: no reset when entering deepsleep mode
      \arg        OB_DEEPSLEEP_RST: generate a reset instead of entering deepsleep mode
    \param[in]  ob_stdby:option byte standby reset value
                only one parameter can be selected which is shown as below:
      \arg        OB_STDBY_NRST: no reset when entering standby mode
      \arg        OB_STDBY_RST: generate a reset instead of entering standby mode
    \param[in]  ob_fwdg_suspend_deepsleep: option byte FWDG suspend status in deep-sleep mode
                only one parameter can be selected which is shown as below:
      \arg        OB_DPSLP_FWDGT_SUSPEND: free watchdog is suspended in deep-sleep mode
      \arg        OB_DPSLP_FWDGT_RUN: free watchdog is running in deep-sleep mode
    \param[in]  ob_fwdg_suspend_standby: option byte FWDG suspend status in standby mode
                only one parameter can be selected which is shown as below:
      \arg        OB_STDBY_FWDGT_SUSPEND: free watchdog is suspended in standby mode
      \arg        OB_STDBY_FWDGT_RUN: free watchdog is running in standby mode
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_low_power_write(uint32_t ob_deepsleep, uint32_t ob_stdby, uint32_t ob_fwdg_suspend_deepsleep,
        uint32_t ob_fwdg_suspend_standby)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_obstat0_config(ob_deepsleep | ob_stdby | ob_fwdg_suspend_deepsleep | ob_fwdg_suspend_standby,
                                           NVMC_OBSTAT0_MDF_NRST_DPSLP | NVMC_OBSTAT0_MDF_NRST_STDBY | NVMC_OBSTAT0_MDF_FWDGSPD_DPSLP | NVMC_OBSTAT0_MDF_FWDGSPD_STDBY);

    return nvmc_ob_state;
}

/*!
    \brief      program the option byte BOR threshold value (API_ID(0x0052U))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  ob_bor_th: user option byte
                only one parameter can be selected which is shown as below:
      \arg        OB_BOR_TH_VALUE3: BOR threshold value 3
      \arg        OB_BOR_TH_VALUE2: BOR threshold value 2
      \arg        OB_BOR_TH_VALUE1: BOR threshold value 1
      \arg        OB_BOR_TH_OFF: no BOR function
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_bor_threshold_config(uint32_t ob_bor_th)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_obstat0_config(ob_bor_th, NVMC_OBSTAT0_MDF_BOR_TH);

    return nvmc_ob_state;
}

/*!
    \brief      enable hardware watchdog (API_ID(0x0053U))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_hardware_watchdog_enable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_obstat0_config(OB_FWDGT_HW, NVMC_OBSTAT0_MDF_NWDG_HW);

    return nvmc_ob_state;
}

/*!
    \brief      disable hardware watchdog (API_ID(0x0054U))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_hardware_watchdog_disable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

