RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_nvmc.c
    nvmc_ob_state = nvmc_ob_obstat0_config(OB_FWDGT_SW, NVMC_OBSTAT0_MDF_NWDG_HW);

    return nvmc_ob_state;
}

/*!
    \brief      enable OTA check (API_ID(0x0055U))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_ota_check_enable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_obstat0_config(OB_OTA_CHECK_ENABLE, NVMC_OBSTAT0_MDF_OTA_CHECK);

    return nvmc_ob_state;
}

/*!
    \brief      disable OTA check (API_ID(0x0056U))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_ota_check_disable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_obstat0_config(OB_OTA_CHECK_DISABLE, NVMC_OBSTAT0_MDF_OTA_CHECK);

    return nvmc_ob_state;
}

/*!
    \brief      enable firmware update (API_ID(0x0057U))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_firmware_update_enable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_obstat0_config(OB_FW_UPDATE_ENABLE, NVMC_OBSTAT0_MDF_FW_UPDATE);

    return nvmc_ob_state;
}

/*!
    \brief      disable firmware update (API_ID(0x0058U))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_firmware_update_disable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_obstat0_config(OB_FW_UPDATE_DISABLE, NVMC_OBSTAT0_MDF_FW_UPDATE);

    return nvmc_ob_state;
}

/*!
    \brief      configure option byte bank0 as data integrity enhancement area of CNVM (API_ID(0x0059U))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_ecnvm_bank0_data_integrity_enhance_cnvm(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_obstat0_config(OB_CNVM_BANK0_DATA_INTEGRITY_ENHANCE, NVMC_OBSTAT0_MDF_SWAP);

    return nvmc_ob_state;
}

/*!
    \brief      configure option byte bank1 as data integrity enhancement area of CNVM (API_ID(0x005AU))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_ecnvm_bank1_data_integrity_enhance_cnvm(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

