RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_nvmc.c
    nvmc_ob_state = nvmc_ob_obstat0_config(OB_CNVM_BANK1_DATA_INTEGRITY_ENHANCE, NVMC_OBSTAT0_MDF_SWAP);

    return nvmc_ob_state;
}

/*!
    \brief      enable ECC of appointed region (API_ID(0x005BU))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  ecc_type: ecc type
                only one parameter can be selected which is shown as below:
      \arg        ITCM_ECC: ITCM ECC function
      \arg        DTCM0_ECC: DTCM0 ECC region
      \arg        DTCM1_ECC: DTCM1 ECC region
      \arg        R2_SRAM_ECC: Region 2 SRAM ECC region
      \arg        R1_SRAM_ECC: Region 1 SRAM ECC region
      \arg        R0_SRAM_ECC: Region 0 SRAM ECC region
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_ecc_enable(uint32_t ecc_type)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    switch(ecc_type) {
    /* enable ITCM ECC */
    case ITCM_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_ITCM_ECC_ENABLE, NVMC_OBSTAT0_MDF_ITCMECCEN);
        break;
    /* enable DTCM0 ECC */
    case DTCM0_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_DTCM0_ECC_ENABLE, NVMC_OBSTAT0_MDF_DTCM0ECCEN);
        break;
    /* enable DTCM1 ECC */
    case DTCM1_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_DTCM1_ECC_ENABLE, NVMC_OBSTAT0_MDF_DTCM1ECCEN);
        break;
    /* enable Region 2 SRAM ECC */
    case R2_SRAM_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_R2_SRAM_ECC_ENABLE, NVMC_OBSTAT0_MDF_R2_SRAM_ECCEN);
        break;
    /* enable Region 1 SRAM ECC */
    case R1_SRAM_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_R1_SRAM_ECC_ENABLE, NVMC_OBSTAT0_MDF_R1_SRAM_ECCEN);
        break;
    /* enable Region 0 SRAM ECC */
    case R0_SRAM_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_R0_SRAM_ECC_ENABLE, NVMC_OBSTAT0_MDF_R0_SRAM_ECCEN);
        break;
    default:
        /* should not be here */
        break;
    }

    return nvmc_ob_state;
}

/*!
    \brief      disable ECC of appointed region (API_ID(0x005CU))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  ecc_type: ecc type
                only one parameter can be selected which is shown as below:
      \arg        ITCM_ECC: ITCM ECC region
      \arg        DTCM0_ECC: DTCM0 ECC region
      \arg        DTCM1_ECC: DTCM1 ECC region
      \arg        R2_SRAM_ECC: Region 2 SRAM ECC region
      \arg        R1_SRAM_ECC: Region 1 SRAM ECC region
      \arg        R0_SRAM_ECC: Region 0 SRAM ECC region
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_ecc_disable(uint32_t ecc_type)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    switch(ecc_type) {
    /* disable ITCM ECC */
    case ITCM_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_ITCM_ECC_DISABLE, NVMC_OBSTAT0_MDF_ITCMECCEN);
        break;
    /* disable DTCM0 ECC */
    case DTCM0_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_DTCM0_ECC_DISABLE, NVMC_OBSTAT0_MDF_DTCM0ECCEN);
        break;
    /* disable DTCM1 ECC */
    case DTCM1_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_DTCM1_ECC_DISABLE, NVMC_OBSTAT0_MDF_DTCM1ECCEN);
        break;
    /* disable Region 2 SRAM ECC */
    case R2_SRAM_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_R2_SRAM_ECC_DISABLE, NVMC_OBSTAT0_MDF_R2_SRAM_ECCEN);
        break;
    /* disable Region 1 SRAM ECC */
    case R1_SRAM_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_R1_SRAM_ECC_DISABLE, NVMC_OBSTAT0_MDF_R1_SRAM_ECCEN);
        break;
    /* disable Region 0 SRAM ECC */
    case R0_SRAM_ECC:
        nvmc_ob_state = nvmc_ob_obstat0_config(OB_R0_SRAM_ECC_DISABLE, NVMC_OBSTAT0_MDF_R0_SRAM_ECCEN);
        break;
    default:
        /* should not be here */
        break;
    }

    return nvmc_ob_state;
}

/*!
    \brief      enable cnvm ecc mode (API_ID(0x005DU))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_cnvm_ecc_enable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_obstat0_config(OB_CNVM_ECC_ENABLE, NVMC_OBSTAT0_MDF_CNVM_ECC_OVRD);

    return nvmc_ob_state;
}

/*!
    \brief      enable cnvm ecc mode config (API_ID(0x005EU))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_cnvm_ecc_mode_config_enable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_obstat0_config(OB_CNVM_ECC_CONTROL_BY_CNVM_ECC_MODE, NVMC_OBSTAT0_MDF_CNVM_ECC_OVRD);

    return nvmc_ob_state;
}

/*!
    \brief      enable pipeline mode (API_ID(0x005FU))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_pipemode_enable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

