RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_nvmc.c
    nvmc_ob_state = nvmc_ob_obstat0_config(OB_PERFORMANCE_FRIENDLY_MODE, NVMC_OBSTAT0_MDF_NOPIPE_MODE);

    return nvmc_ob_state;
}

/*!
    \brief      disable pipeline mode (API_ID(0x0060U))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat0_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_pipemode_disable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_obstat0_config(OB_TIMING_FRIENDLY_MODE, NVMC_OBSTAT0_MDF_NOPIPE_MODE);

    return nvmc_ob_state;
}

/*!
    \brief      program the option bytes OBSTAT1 (API_ID(0x0061U))
    \param[in]  ob_obstat1: obstat1 option bytes. When write one parameter, the corresponding mask should be set.
                one or more  parameters can be selected which are shown as below:
      \arg        OB_ITCM_DTCM_SHARED_ITCM_0KB/OB_ITCM_DTCM_SHARED_ITCM_64KB/OB_ITCM_DTCM_SHARED_ITCM_128KB/OB_ITCM_DTCM_SHARED_ITCM_192KB/OB_ITCM_DTCM_SHARED_ITCM_256KB: ITCM DTCM shared RAM ITCM size
      \arg        OB_ITCM_AXI_SHARED_ITCM_0KB/OB_ITCM_AXI_SHARED_ITCM_64KB/OB_ITCM_AXI_SHARED_ITCM_128KB/OB_ITCM_AXI_SHARED_ITCM_192KB/OB_ITCM_AXI_SHARED_ITCM_256KB: ITCM AXI shared RAM ITCM size
      \arg        OB_SYSCFG_CPU_BUS_TIMEOUT_RESET_DISABLE/OB_SYSCFG_CPU_BUS_TIMEOUT_RESET_ENABLE: disable/enable CPU bus timeout
    \param[in]  ob_obstat1_mask: obstat1 bits mask. They correspond to the above parameter value one by one.
                  one or more parameters can be selected which are shown as below:
      \arg        NVMC_OBSTAT1_MDF_ITCM_AXI_SHARED: ITCM and AXI RAM sharing status bit mask
      \arg        NVMC_OBSTAT1_MDF_ITCM_DTCM_SHARED: ITCM and DTCM RAM sharing status bit mask
      \arg        NVMC_OBSTAT1_MDF_CPUBUSTO: CPU bus timeout status bit mask
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_obstat1_config(uint32_t ob_obstat1, uint32_t ob_obstat1_mask)
{
    uint32_t obstat1_reg;
    uint32_t obstat0_eft_spc = NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_SPC;
    uint32_t otp_user_ctl0_spc_h = NVMC_OTP_USER_CTL0 & NVMC_OTP_USER_CTL0_SPC_H;
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    /* check the option bytes security protection value */
    if((OB_HSPC == obstat0_eft_spc) || otp_user_ctl0_spc_h) {
        nvmc_ob_state = NVMC_HSPC;
    } else {
        /* wait for the nvmc ready */
        nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);

        if(NVMC_OB_READY == nvmc_ob_state) {
            obstat1_reg = NVMC_OBSTAT1_EFT;

            NVMC_OBSTAT1_MDF = (obstat1_reg & (~ob_obstat1_mask)) | (ob_obstat1 & ob_obstat1_mask);
            /* set the OBSTART bit */
            NVMC_OBCTL |= NVMC_OBCTL_OBSTART;
            /* wait for the nvmc ready */
            nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);
        }
    }
    return nvmc_ob_state;
}

/*!
    \brief      program the option bytes user data (API_ID(0x0062U))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat1_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  user_data: user option bytes (0x00000000 - 0x00007FFF)
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_data_config(uint32_t user_data)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_OB_DATA_RANGE(user_data)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0062U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        nvmc_ob_state = nvmc_ob_obstat1_config(user_data << OBSTAT1_DATA_OFFSET, NVMC_OBSTAT1_MDF_DATA);
    }
    return nvmc_ob_state;
}

/*!
    \brief      configure the ITCM size in ITCM/DTCM shared RAM (API_ID(0x0063U))
                ITCM RAM + DTCM RAM size should not exceed 512KB
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat1_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  itcm_size: ITCM size in ITCM/DTCM shared RAM
                only one parameter can be selected which is shown as below:
      \arg        OB_ITCM_DTCM_SHARED_ITCM_0KB: ITCM size is 0Kbyte in ITCM DTCM shared RAM
      \arg        OB_ITCM_DTCM_SHARED_ITCM_64KB: ITCM size is 64-Kbyte in ITCM DTCM shared RAM
      \arg        OB_ITCM_DTCM_SHARED_ITCM_128KB: ITCM size is 128-Kbyte in ITCM DTCM shared RAM
      \arg        OB_ITCM_DTCM_SHARED_ITCM_192KB: ITCM size is 192-Kbyte in ITCM DTCM shared RAM
      \arg        OB_ITCM_DTCM_SHARED_ITCM_256KB: ITCM size is 256-Kbyte in ITCM DTCM shared RAM
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_itcm_dtcm_shared_ram_config(uint32_t itcm_size)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_OB_ITCM_DTCM_SHARED_ITCM_SIZE(itcm_size)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0063U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        nvmc_ob_state = nvmc_ob_obstat1_config(itcm_size, NVMC_OBSTAT1_MDF_ITCM_DTCM_SHARED);
    }
    return nvmc_ob_state;
}

/*!
    \brief      configure the ITCM size in ITCM/AXI shared RAM (API_ID(0x0064U))
                ITCM RAM + DTCM RAM size should not exceed 512KB
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat1_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  itcm_size: ITCM size in ITCM/AXI shared RAM
                only one parameter can be selected which is shown as below:
      \arg        OB_ITCM_AXI_SHARED_ITCM_0KB: ITCM size is 0-Kbyte ITCM AXI shared RAM
      \arg        OB_ITCM_AXI_SHARED_ITCM_64KB: ITCM size is 64-Kbyte ITCM AXI shared RAM
      \arg        OB_ITCM_AXI_SHARED_ITCM_128KB: ITCM size is 128-Kbyte ITCM AXI shared RAM
      \arg        OB_ITCM_AXI_SHARED_ITCM_192KB: ITCM size is 192-Kbyte ITCM AXI shared RAM
      \arg        OB_ITCM_AXI_SHARED_ITCM_256KB: ITCM size is 256-Kbyte ITCM AXI shared RAM
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_itcm_axi_shared_ram_config(uint32_t itcm_size)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_OB_ITCM_AXI_SHARED_ITCM_SIZE(itcm_size)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0064U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        nvmc_ob_state = nvmc_ob_obstat1_config(itcm_size, NVMC_OBSTAT1_MDF_ITCM_AXI_SHARED);
    }
    return nvmc_ob_state;
}

/*!
    \brief      configure the reset value of the CPUBUSTO bit in SYSCFG_BUSTO (API_ID(0x0065U))
                For independent functions that complete option byte configuration by calling nvmc_ob_obstat1_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  cpubusto_value: the reset value of the CPUBUSTO bit
                only one parameter can be selected which is shown as below:
      \arg        OB_SYSCFG_CPU_BUS_TIMEOUT_RESET_DISABLE: disable CPU bus timeout
      \arg        OB_SYSCFG_CPU_BUS_TIMEOUT_RESET_ENABLE: enable CPU bus timeout
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_cpubusto_reset_value_config(uint32_t cpubusto_value)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_OB_CPUBUSTO_RESET_VALUE(cpubusto_value)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0065U), ERR_PARAM_INVALID);
    } else
#endif
    {
        nvmc_ob_state = nvmc_ob_obstat1_config(cpubusto_value, NVMC_OBSTAT1_MDF_CPUBUSTO);
    }
    return nvmc_ob_state;
}

/*!
    \brief      configure the option byte boot address value (API_ID(0x0066U))
    \param[in]  boot_pin: boot pin configuration
                only one parameter can be selected which is shown as below:
      \arg        BOOT_PIN_0: boot pin value is '0'
      \arg        BOOT_PIN_1: boot pin value is '1'
    \param[in]  boot_address: specify the MSB of boot address
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_boot_address_config(uint32_t boot_pin, uint16_t boot_address)
{
    uint32_t btaddr_reg;
    uint32_t obstat0_eft_spc = NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_SPC;
    uint32_t otp_user_ctl0_spc_h = NVMC_OTP_USER_CTL0 & NVMC_OTP_USER_CTL0_SPC_H;
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_NVMC_BOOT_PIN_VALUE(boot_pin)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0066U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* check the option bytes security protection value */
        if((OB_HSPC == obstat0_eft_spc) || otp_user_ctl0_spc_h) {
            nvmc_ob_state = NVMC_HSPC;
        } else {
            /* wait for the nvmc ready */
            nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);

            if(NVMC_OB_READY == nvmc_ob_state) {
                btaddr_reg = NVMC_BTADDR_EFT;

                if(BOOT_PIN_0 == boot_pin) {
                    /* set boot address 0 */
                    btaddr_reg &= ~NVMC_BTADDR_MDF_BOOT_ADDR0;
                    btaddr_reg |= (uint32_t)((uint32_t)boot_address << BTADDR_BOOT_ADDR0_OFFSET);
                } else {
                    /* set boot address 1 */
                    btaddr_reg &= ~NVMC_BTADDR_MDF_BOOT_ADDR1;
                    btaddr_reg |= (uint32_t)((uint32_t)boot_address << BTADDR_BOOT_ADDR1_OFFSET);
                }
                NVMC_BTADDR_MDF = btaddr_reg;

