RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_nvmc.c
                NVMC_OBCTL |= NVMC_OBCTL_OBSTART;

                /* wait for the nvmc ready */
                nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);
            }
        }
    }
    return nvmc_ob_state;
}

/*!
    \brief      configure the option byte DCRP area (API_ID(0x0067U))
    \param[in]  dcrp_en: DCRP area enable bit
                one or more parameters can be selected which are shown as below:
                For GD32H77XXI/GD32H78XXI: dcrp_en can only select OB_CNVM_DCRP_AREA_ENABLE
      \arg        OB_ECNVM_BANK1_DCRP_AREA_DISABLE: ECNVM BANK1 DCRP area disable
      \arg        OB_ECNVM_BANK1_DCRP_AREA_ENABLE: ECNVM BANK1 DCRP area enable
      \arg        OB_ECNVM_BANK0_DCRP_AREA_DISABLE: ECNVM BANK0 DCRP area disable
      \arg        OB_ECNVM_BANK0_DCRP_AREA_ENABLE: ECNVM BANK0 DCRP area enable
      \arg        OB_CNVM_DCRP_AREA_DISABLE: CNVM DCRP area disable
      \arg        OB_CNVM_DCRP_AREA_ENABLE: CNVM DCRP area enable
    \param[in]  dcrp_eren: DCRP area erase enable bit
                one or more parameters can be selected which are shown as below:
      \arg        OB_ECNVM_BANK1_DCRP_AREA_ERASE_DISABLE: ECNVM BANK1 DCRP area erase disable
      \arg        OB_ECNVM_BANK1_DCRP_AREA_ERASE_ENABLE: ECNVM BANK1 DCRP area erase enable
      \arg        OB_ECNVM_BANK0_DCRP_AREA_ERASE_DISABLE: ECNVM BANK0 DCRP area erase disable
      \arg        OB_ECNVM_BANK0_DCRP_AREA_ERASE_ENABLE: ECNVM BANK0 DCRP area erase enable
      \arg        OB_CNVM_DCRP_AREA_ERASE_DISABLE: CNVM DCRP area erase disable
      \arg        OB_CNVM_DCRP_AREA_ERASE_ENABLE: CNVM DCRP area erase enable
    \param[in]  dcrp_start: DCRP area start block number, contains the first 4K-byte block of the DCRP area.(GD32H77XXW/GD32H78XXW and GD32H77XXP/GD32H78XXP: 0 - 0x1FF, GD32H77XXI/GD32H78XXI: 0 - 0x19F)
    \param[in]  dcrp_end: DCRP area end block number, contains the last 4K-byte block of the DCRP area.(GD32H77XXW/GD32H78XXW and GD32H77XXP/GD32H78XXP: 0 - 0x1FF, GD32H77XXI/GD32H78XXI: 0 - 0x19F)
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_dcrp_area_config(uint32_t dcrp_en, uint32_t dcrp_eren, uint32_t dcrp_start, uint32_t dcrp_end)
{
    uint32_t obstat0_eft_spc = NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_SPC;
    uint32_t otp_user_ctl0_spc_h = NVMC_OTP_USER_CTL0 & NVMC_OTP_USER_CTL0_SPC_H;
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_NVMC_DCRP_AREA_START(dcrp_start)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0067U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_NVMC_DCRP_AREA_END(dcrp_end)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0067U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        /* check the option bytes security protection value */
        if((OB_HSPC == obstat0_eft_spc) || otp_user_ctl0_spc_h) {
            nvmc_ob_state = NVMC_HSPC;
        } else {

            /* wait for the nvmc ready */
            nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);

            if(NVMC_OB_READY == nvmc_ob_state) {
                NVMC_DCRPADDR_MDF = (dcrp_eren & DCRP_EREN_MASK) | (dcrp_en & DCRP_EN_MASK) | (dcrp_end << DCRPADDR_DCRP_AREA_END_OFFSET) | dcrp_start;
                /* set the OBSTART bit */
                NVMC_OBCTL |= NVMC_OBCTL_OBSTART;
                /* wait for the nvmc ready */
                nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);
            }
        }
    }
    return nvmc_ob_state;
}

/*!
    \brief      configure the option byte secure area (API_ID(0x0068U))
    \param[in]  scr_en: DCRP area enable bit
                one or more parameters can be selected which are shown as below:
                For GD32H77XXI/GD32H78XXI: dcrp_en can only select OB_CNVM_SECURE_AREA_ENABLE
      \arg        OB_ECNVM_BANK1_SECURE_AREA_DISABLE: ECNVM BANK1 SCR area disable
      \arg        OB_ECNVM_BANK1_SECURE_AREA_ENABLE: ECNVM BANK1 SCR area enable
      \arg        OB_ECNVM_BANK0_SECURE_AREA_DISABLE: ECNVM BANK0 SCR area disable
      \arg        OB_ECNVM_BANK0_SECURE_AREA_ENABLE: ECNVM BANK0 SCR area enable
      \arg        OB_CNVM_SECURE_AREA_DISABLE: CNVM SCR area disable
      \arg        OB_CNVM_SECURE_AREA_ENABLE: CNVM SCR area enable
    \param[in]  scr_eren: DCRP area erase enable bit
                one or more parameters can be selected which are shown as below:
      \arg        OB_ECNVM_BANK1_SECURE_AREA_ERASE_DISABLE: ECNVM BANK1 SCR area erase disable
      \arg        OB_ECNVM_BANK1_SECURE_AREA_ERASE_ENABLE: ECNVM BANK1 SCR area erase enable
      \arg        OB_ECNVM_BANK0_SECURE_AREA_ERASE_DISABLE: ECNVM BANK0 SCR area erase disable
      \arg        OB_ECNVM_BANK0_SECURE_AREA_ERASE_ENABLE: ECNVM BANK0 SCR area erase enable
      \arg        OB_CNVM_SECURE_AREA_ERASE_DISABLE: CNVM SCR area erase disable
      \arg        OB_CNVM_SECURE_AREA_ERASE_ENABLE: CNVM SCR area erase enable
    \param[in]  scr_start: secure area start block number, contains the first 4K-byte block of the secure-access area.(GD32H77XXW/GD32H78XXW and GD32H77XXP/GD32H78XXP: 0 - 0x1FF, GD32H77XXI/GD32H78XXI: 0 - 0x19F)
    \param[in]  scr_end: secure area end block number, contains the last 4K-byte block of the secure-access area.(GD32H77XXW/GD32H78XXW and GD32H77XXP/GD32H78XXP: 0 - 0x1FF, GD32H77XXI/GD32H78XXI: 0 - 0x19F)
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_secure_area_config(uint32_t scr_en, uint32_t scr_eren, uint32_t scr_start, uint32_t scr_end)
{
    uint32_t obstat0_eft_spc = NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_SPC;
    uint32_t otp_user_ctl0_spc_h = NVMC_OTP_USER_CTL0 & NVMC_OTP_USER_CTL0_SPC_H;
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_NVMC_SCR_AREA_START(scr_start)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0068U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_NVMC_SCR_AREA_END(scr_end)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0068U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        /* check the option bytes security protection value */
        if((OB_HSPC == obstat0_eft_spc) || otp_user_ctl0_spc_h) {
            nvmc_ob_state = NVMC_HSPC;
        } else {
            /* wait for the nvmc ready */
            nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);

            if(NVMC_OB_READY == nvmc_ob_state) {
                NVMC_SCRADDR_MDF = (scr_eren & SCR_EREN_MASK) | (scr_en & SCR_EN_MASK) | (scr_end << SCRADDR_SCR_AREA_END_OFFSET) | scr_start;

