RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_nvmc.c
                NVMC_OBCTL |= NVMC_OBCTL_OBSTART;
                /* wait for the nvmc ready */
                nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);
            }
        }
    }
    return nvmc_ob_state;
}

/*!
    \brief      enable erase/program protection (API_ID(0x0069U))
    \param[in]  wp_area: erase/program protection area, when GD32H77XXI/GD32H78XXI is selected, only WP_AREA_CNVM can be selected, WP_AREA_ECNVM can not be selected.
                only one parameter can be selected which is shown as below:
      \arg        WP_AREA_ECNVM: main ecnvm erase/program protection area (in GD32H77XXW/GD32H78XXW, GD32H77XXP/GD32H78XXP, WP_AREA_ECNVM can be selected, in GD32H77XXI/GD32H78XXI, WP_AREA_ECNVM can not be selected)
      \arg        WP_AREA_CNVM: CNVM erase/program protection area (in GD32H77XXW/GD32H78XXW, GD32H77XXP/GD32H78XXP and GD32H77XXI/GD32H78XXI, WP_AREA_CNVM can be selected)
    \param[in]  ob_wp: specify sector to be erase/program protected, when wp_area = WP_AREA_CNVM, only OB_CNVM_WP_x and OB_CNVM_WP_ALL can be selected
                       when wp_area = WP_AREA_ECNVM, only OB_FL_WP_x and OB_ECNVM_WP_ALL can be selected
                one or more parameters can be selected which are shown as below:
      \arg        OB_CNVM_WP_x(when wp_area = WP_AREA_CNVM): write protect sector (x*2) ~ sector (x*2+1)(GD32H77XXW/GD32H78XXW and GD32H77XXP/GD32H78XXP: x = 0,1...15, GD32H77XXI/GD32H78XXI: x = 0,1...12) of CNVM
      \arg        OB_CNVM_WP_ALL(when wp_area = WP_AREA_CNVM): write protect all sectors of CNVM
      \arg        OB_FL_WP_x(when wp_area = WP_AREA_ECNVM): write protect sector (x*2 + 32) ~ sector (x*2+33)(GD32H77XXW/GD32H78XXW: x = 0,1...59, GD32H77XXP/GD32H78XXP: x = 0,1...27, GD32H77XXI/GD32H78XXI: OB_FL_WP_x is invalid) of main ecnvm
      \arg        OB_ECNVM_WP_ALL(when wp_area = WP_AREA_ECNVM): write protect all sectors of main ecnvm
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_write_protection_enable(wp_area_enum wp_area, uint64_t ob_wp)
{
    uint32_t wp_reg;
    uint32_t obstat0_eft_spc = NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_SPC;
    uint32_t otp_user_ctl0_spc_h = NVMC_OTP_USER_CTL0 & NVMC_OTP_USER_CTL0_SPC_H;
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    /* check the option bytes security protection value */
    if((OB_HSPC == obstat0_eft_spc) || otp_user_ctl0_spc_h) {
        nvmc_ob_state = NVMC_HSPC;
    } else {
        /* wait for the nvmc ready */
        nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);

        if(NVMC_OB_READY == nvmc_ob_state) {
#ifndef NVM_VER_1_625_AND_0
            if(WP_AREA_ECNVM == wp_area) {
                /* configure the enable erase/program protection bit in NVMC_WP0_ECNVM_EFT register */
                wp_reg = NVMC_WP0_ECNVM_EFT;
                wp_reg &= ~(uint32_t)(ob_wp & NVMC_WP0_ECNVM_EFT_WP);
                NVMC_WP0_ECNVM_MDF = wp_reg;
#if defined(NVM_VER_2_AND_3_5)
                NVMC_WP0_ECNVM_MDF |= 0xF0000000;
                NVMC_WP1_ECNVM_MDF = 0x0FFFFFFF;
#endif /* NVM_VER_2_AND_3_5 */

#if defined(NVM_VER_2_AND_7_5)
                /* configure the enable erase/program protection bit in NVMC_WP1_ECNVM_EFT register */
                wp_reg = NVMC_WP1_ECNVM_EFT;
                wp_reg &= ~(uint32_t)((ob_wp >> WP1_ECNVM_OFFSET) & (uint32_t)(OB_ECNVM_WP_ALL >> WP1_ECNVM_OFFSET));
                NVMC_WP1_ECNVM_MDF = wp_reg;
#endif /* NVM_VER_2_AND_7_5 */
                /* set the OBSTART bit */
                NVMC_OBCTL |= NVMC_OBCTL_OBSTART;

            } else
#endif /* NVM_VER_1_625_AND_0 */
            {
                if(WP_AREA_CNVM == wp_area) {
                    /* configure the enable erase/program protection bit in NVMC_WP_CNVM_MDF register */
                    wp_reg = NVMC_WP_CNVM_EFT;
                    wp_reg &= ~((uint32_t)ob_wp & OB_CNVM_WP_ALL);
                    NVMC_WP_CNVM_MDF = wp_reg;
#if defined(NVM_VER_1_625_AND_0)
                    NVMC_WP_CNVM_MDF |= 0x0000E000;
#endif /* NVM_VER_1_625_AND_0 */

                    /* set the OBSTART bit */
                    NVMC_OBCTL |= NVMC_OBCTL_OBSTART;
                } else {
                    /* illegal parameters */
                }
            }

            /* wait for the nvmc ready */
            nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);
        }
    }

    return nvmc_ob_state;
}

/*!
    \brief      disable erase/program protection (API_ID(0x006AU))
    \param[in]  wp_area: erase/program protection area, when GD32H77XXI/GD32H78XXI is selected, only WP_AREA_CNVM can be selected, WP_AREA_ECNVM can not be selected.
                only one parameter can be selected which is shown as below:
      \arg        WP_AREA_ECNVM: main ecnvm erase/program protection area (in GD32H77XXW/GD32H78XXW, GD32H77XXP/GD32H78XXP, WP_AREA_ECNVM can be selected, in GD32H77XXI/GD32H78XXI, WP_AREA_ECNVM can not be selected)
      \arg        WP_AREA_CNVM: CNVM erase/program protection area (in GD32H77XXW/GD32H78XXW, GD32H77XXP/GD32H78XXP and GD32H77XXI/GD32H78XXI, WP_AREA_CNVM can be selected)
    \param[in]  ob_wp: specify sector to be erase/program protected, when wp_area = WP_AREA_CNVM, only OB_CNVM_WP_x and OB_CNVM_WP_ALL can be selected
                       when wp_area = WP_AREA_ECNVM, only OB_FL_WP_x and OB_ECNVM_WP_ALL can be selected
                one or more parameters can be selected which are shown as below:
      \arg        OB_CNVM_WP_x(when wp_area = WP_AREA_CNVM): write protect sector (x*2) ~ sector (x*2+1)(GD32H77XXW/GD32H78XXW and GD32H77XXP/GD32H78XXP: x = 0,1...15, GD32H77XXI/GD32H78XXI: x = 0,1...12) of CNVM
      \arg        OB_CNVM_WP_ALL(when wp_area = WP_AREA_CNVM): write protect all sectors of CNVM
      \arg        OB_FL_WP_x(when wp_area = WP_AREA_ECNVM): write protect sector (x*2 + 32) ~ sector (x*2+33)(GD32H77XXW/GD32H78XXW: x = 0,1...59, GD32H77XXP/GD32H78XXP: x = 0,1...27, GD32H77XXI/GD32H78XXI: OB_FL_WP_x is invalid) of main ecnvm
      \arg        OB_ECNVM_WP_ALL(when wp_area = WP_AREA_ECNVM): write protect all sectors of main ecnvm
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_write_protection_disable(wp_area_enum wp_area, uint64_t ob_wp)
{
    uint32_t wp_reg;
    uint32_t obstat0_eft_spc = NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_SPC;
    uint32_t otp_user_ctl0_spc_h = NVMC_OTP_USER_CTL0 & NVMC_OTP_USER_CTL0_SPC_H;
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    /* check the option bytes security protection value */
    if((OB_HSPC == obstat0_eft_spc) || otp_user_ctl0_spc_h) {
        nvmc_ob_state = NVMC_HSPC;
    } else {
        /* wait for the nvmc ready */
        nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);

        if(NVMC_OB_READY == nvmc_ob_state) {
#ifndef NVM_VER_1_625_AND_0
            if(WP_AREA_ECNVM == wp_area) {
                /* configure the disable erase/program protection bit in NVMC_WP0_ECNVM_EFT register */
                wp_reg = NVMC_WP0_ECNVM_EFT;
                wp_reg |= (uint32_t)(ob_wp & NVMC_WP0_ECNVM_EFT_WP);
                NVMC_WP0_ECNVM_MDF = wp_reg;
#if defined(NVM_VER_2_AND_3_5)
                NVMC_WP0_ECNVM_MDF |= 0xF0000000;
                NVMC_WP1_ECNVM_MDF = 0x0FFFFFFF;
#endif /* NVM_VER_2_AND_3_5 */

#if defined(NVM_VER_2_AND_7_5)
                /* configure the disable erase/program protection bit in NVMC_WP1_ECNVM_EFT register */
                wp_reg = NVMC_WP1_ECNVM_EFT;
                wp_reg |= (uint32_t)((ob_wp >> WP1_ECNVM_OFFSET) & (uint32_t)(OB_ECNVM_WP_ALL >> WP1_ECNVM_OFFSET));
                NVMC_WP1_ECNVM_MDF = wp_reg;
#endif /* NVM_VER_2_AND_7_5 */
                /* set the OBSTART bit */
                NVMC_OBCTL |= NVMC_OBCTL_OBSTART;
            } else
#endif /* NVM_VER_1_625_AND_0 */
            {
                if(WP_AREA_CNVM == wp_area) {
                    /* configure the disable erase/program protection bit in NVMC_WP_CNVM_MDF register */
                    wp_reg = NVMC_WP_CNVM_EFT;
                    wp_reg |= (uint32_t)ob_wp & OB_CNVM_WP_ALL;
                    NVMC_WP_CNVM_MDF = wp_reg;
#if (defined(NVM_VER_1_625_AND_0))
                    NVMC_WP_CNVM_MDF |= 0x0000E000;
#endif
                    /* set the OBSTART bit */
                    NVMC_OBCTL |= NVMC_OBCTL_OBSTART;
                } else {
                    /* illegal parameters */
                }
            }

