RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_nvmc.c
            /* wait for the nvmc ready */
            nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);
        }
    }
    return nvmc_ob_state;
}

/*!
    \brief      program the option bytes OBREPCTL (API_ID(0x006BU))
    \param[in]  ob_repctl: repair control option bytes. When write one parameter, the corresponding mask should be set.
                one or more parameters can be selected which are shown as below:
      \arg        POR_RESET_REPAIR_DISABLE/POR_RESET_REPAIR_ENABLE: disable/enable power-on reset self-check repair function
      \arg        SYS_RESET_REPAIR_DISABLE/SYS_RESET_REPAIR_ENABLE: disable/enable system reset self-check repair function
      \arg        REPAIR_FAIL_FOR_ANY_ERROR/REPAIR_FAIL_FOR_MORE_THAN_ERR1: After repair, any error occurs(errors greater than 1 bit) as repair failure
      \arg        BAD_CNVM_ADDR_REPLACE_DISABLE/BAD_CNVM_ADDR_REPLACE_ENABLE: disable/enable bad data replacement in CNVM with ecnvm content
      \arg        REPAIR_UNLOCK_DISABLE/REPAIR_UNLOCK_ENABLE: disable/enable fix address with error
      \arg        OB_HW_SELF_CHECK_DISABLE/OB_HW_SELF_CHECK_ENABLE: hardware not do self-check mode/hardware self-check mode
      \arg        OB_DATA_INTEGRITY_ENHANCE_MODE_DISABLE/OB_DATA_INTEGRITY_ENHANCE_MODE_ENABLE: disable/enable data integrity enhancement mode
    \param[in]  ob_repctl_mask: repair control bits mask. They correspond to the above parameter value one by one.
                  one or more parameters can be selected which are shown as below:
      \arg        NVMC_OBREPCTL_MDF_PORRSTREPDIS: The power-on reset self-check repair function enable status bit mask
      \arg        NVMC_OBREPCTL_MDF_SYSRSTREPDIS: The system reset self-check repair function enable status bit mask
      \arg        NVMC_OBREPCTL_MDF_BBMODE: Mode of determining whether the repair is successful after the repair bit mask
      \arg        NVMC_OBREPCTL_MDF_BBREPLEN: Bad block address replace status bit mask
      \arg        NVMC_OBREPCTL_MDF_REPUNLK: Error repair unlock enable status bit mask
      \arg        NVMC_OBREPCTL_MDF_HWREPMOD: Hardware self-check mode status bit mask
      \arg        NVMC_OBREPCTL_MDF_DIEEN: The data integrity enhancement mode enable status bit mask
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_repair_control_config(uint32_t ob_repctl, uint32_t ob_repctl_mask)
{
    uint32_t obrepctl_reg;
    uint32_t obstat0_eft_spc = NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_SPC;
    uint32_t otp_user_ctl0_spc_h = NVMC_OTP_USER_CTL0 & NVMC_OTP_USER_CTL0_SPC_H;
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    /* check the option bytes security protection value */
    if((OB_HSPC == obstat0_eft_spc) || otp_user_ctl0_spc_h) {
        nvmc_ob_state = NVMC_HSPC;
    } else {
        /* wait for the nvmc ready */
        nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);

        if(NVMC_OB_READY == nvmc_ob_state) {
            obrepctl_reg = NVMC_OBREPCTL_EFT;

            NVMC_OBREPCTL_MDF = (obrepctl_reg & (~ob_repctl_mask)) | (ob_repctl & ob_repctl_mask);
            NVMC_OBCTL |= NVMC_OBCTL_OBSTART;
            /* wait for the nvmc ready */
            nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);
        }
    }
    return nvmc_ob_state;
}

/*!
    \brief      configure update size during OTA upgrate (API_ID(0x006CU))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  value: update size during OTA upgrate with granularity 32KB. (value:0x00 - 0x3F, update size = (value + 1) * 32KB)
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_update_size_config(uint32_t value)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_NVMC_OB_UPDATE_SIZE(value)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x006CU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        nvmc_ob_state = nvmc_ob_repair_control_config(value << OBREPCTL_UPDATESZ_OFFSET, NVMC_OBREPCTL_MDF_UPDATESZ);
    }
    return nvmc_ob_state;
}

/*!
    \brief      configure data integrity enhance area size (API_ID(0x006DU))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  value: data_integrity_enhance area size with granularity 64KB. (value: 0x00 - 0x1F, data_integrity_enhance area size = (value + 1) * 64KB)
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_data_integrity_enhance_area_size_config(uint32_t value)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_NVMC_OB_DATA_INTEGRITY_ENHANCE_SIZE(value)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x006DU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        nvmc_ob_state = nvmc_ob_repair_control_config(value << OBREPCTL_DIESZ_OFFSET, NVMC_OBREPCTL_MDF_DIESZ);
    }
    return nvmc_ob_state;
}

/*!
    \brief      enable power-on reset self-check repair (API_ID(0x006EU))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_power_on_self_check_enable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_repair_control_config(POR_RESET_REPAIR_ENABLE, NVMC_OBREPCTL_MDF_PORRSTREPDIS);

    return nvmc_ob_state;
}

/*!
    \brief      disable power-on reset self-check repair (API_ID(0x006FU))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_power_on_self_check_disable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_repair_control_config(POR_RESET_REPAIR_DISABLE, NVMC_OBREPCTL_MDF_PORRSTREPDIS);

    return nvmc_ob_state;
}

/*!
    \brief      enable system reset self-check repair (API_ID(0x0070U))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_system_reset_check_enable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_repair_control_config(SYS_RESET_REPAIR_ENABLE, NVMC_OBREPCTL_MDF_SYSRSTREPDIS);

    return nvmc_ob_state;
}

/*!
    \brief      disable system reset self-check repair (API_ID(0x0071U))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_system_reset_check_disable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_repair_control_config(SYS_RESET_REPAIR_DISABLE, NVMC_OBREPCTL_MDF_SYSRSTREPDIS);

    return nvmc_ob_state;
}

/*!
    \brief      enable bad data replacement in CNVM with ecnvm content (API_ID(0x0072U))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_cnvm_bad_data_replace_enable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_repair_control_config(BAD_CNVM_ADDR_REPLACE_ENABLE, NVMC_OBREPCTL_MDF_BBREPLEN);

    return nvmc_ob_state;
}

/*!
    \brief      disable bad data replacement in CNVM with ecnvm content (API_ID(0x0073U))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_cnvm_bad_data_replace_disable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

