RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_nvmc.c
    nvmc_ob_state = nvmc_ob_repair_control_config(BAD_CNVM_ADDR_REPLACE_DISABLE, NVMC_OBREPCTL_MDF_BBREPLEN);

    return nvmc_ob_state;
}

/*!
    \brief      enable error repair unlock during self check (API_ID(0x0074U))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_error_repair_unlock_enable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_repair_control_config(REPAIR_UNLOCK_ENABLE, NVMC_OBREPCTL_MDF_REPUNLK);

    return nvmc_ob_state;
}

/*!
    \brief      disable error repair unlock during self check (API_ID(0x0075U))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_error_repair_unlock_disable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_repair_control_config(REPAIR_UNLOCK_DISABLE, NVMC_OBREPCTL_MDF_REPUNLK);

    return nvmc_ob_state;
}

/*!
    \brief      enable data integrity enhancement mode (API_ID(0x0076U))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_data_integrity_enhance_mode_enable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_repair_control_config(OB_DATA_INTEGRITY_ENHANCE_MODE_ENABLE, NVMC_OBREPCTL_MDF_DIEEN);

    return nvmc_ob_state;
}

/*!
    \brief      disable data integrity enhancement mode (API_ID(0x0077U))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_data_integrity_enhance_mode_disable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_repair_control_config(OB_DATA_INTEGRITY_ENHANCE_MODE_DISABLE, NVMC_OBREPCTL_MDF_DIEEN);

    return nvmc_ob_state;
}

/*!
    \brief      enable hardware self-check mode (API_ID(0x0078U))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_hardware_self_check_enable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_repair_control_config(OB_HW_SELF_CHECK_ENABLE, NVMC_OBREPCTL_MDF_HWREPMOD);

    return nvmc_ob_state;
}

/*!
    \brief      disable hardware self-check mode (API_ID(0x0079U))
                For independent functions that complete option byte configuration by calling nvmc_ob_repair_control_config, only one such independent function
                can be called at a time to complete the reset and activation of the option byte configuration. When multiple independent functions are called,
                only the configuration of the option byte by the last independent function takes effect after the reset.
    \param[in]  none
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_hardware_self_check_disable(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

    nvmc_ob_state = nvmc_ob_repair_control_config(OB_HW_SELF_CHECK_DISABLE, NVMC_OBREPCTL_MDF_HWREPMOD);

    return nvmc_ob_state;
}

/*!
    \brief      configure repair address (API_ID(0x007AU))
    \param[in]  repair_start: self-check repair start offset address(GD32H77XXW/GD32H78XXW and GD32H77XXP/GD32H78XXP: 0 - 0xFFFF, GD32H77XXI/GD32H78XXI: 0 - 0xCFFF, granularity is 256bit)
    \param[in]  repair_end: self-check repair end offset address(GD32H77XXW/GD32H78XXW and GD32H77XXP/GD32H78XXP: 0 - 0xFFFF, GD32H77XXI/GD32H78XXI: 0 - 0xCFFF, granularity is 256bit)
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_repair_address_config(uint32_t repair_start, uint32_t repair_end)
{
    uint32_t obstat0_eft_spc = NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_SPC;
    uint32_t otp_user_ctl0_spc_h = NVMC_OTP_USER_CTL0 & NVMC_OTP_USER_CTL0_SPC_H;
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_NVMC_REPAIR_AREA_START(repair_start)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x007AU), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_NVMC_REPAIR_AREA_END(repair_end)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x007AU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        /* check the option bytes security protection value */
        if((OB_HSPC == obstat0_eft_spc) || otp_user_ctl0_spc_h) {
            nvmc_ob_state = NVMC_HSPC;
        } else {
            /* wait for the nvmc ready */
            nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);

            if(NVMC_OB_READY == nvmc_ob_state) {
                NVMC_OBREPSTADDR_MDF = (repair_start << OBREPSTADDR_STARTADDR_OFFSET) & NVMC_OBREPSTADDR_MDF_STARTADDR;
                NVMC_OBREPENDADDR_MDF = (repair_end << OBREPSTADDR_ENDADDR_OFFSET) & NVMC_OBREPENDADDR_MDF_ENDADDR;
                /* set the OBSTART bit */
                NVMC_OBCTL |= NVMC_OBCTL_OBSTART;
                /* wait for the nvmc ready */
                nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);
            }
        }
    }
    return nvmc_ob_state;
}

/*!
    \brief      configure bad block address (API_ID(0x007BU))
    \param[in]  index: bad block index in NVMC_OBBBADDRX_MDF (index = 0 - 3)
    \param[in]  bad_block_valid: the bad block address valid status (0: invalid, 1: valid)
    \param[in]  bad_block_address: bad block address (GD32H77XXW/GD32H78XXW and GD32H77XXP/GD32H78XXP: 0 - 0xFFFF, GD32H77XXI/GD32H78XXI: 0 - 0xCFFF, granularity is 256bit)
    \param[out] none
    \retval     state of option byte modification
      \arg        NVMC_OB_READY: NVMC operation has been completed
      \arg        NVMC_OB_BUSY: NVMC operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modified error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
      \arg        NVMC_HSPC: high security protection
*/
nvmc_ob_state_enum nvmc_ob_bad_block_address_config(uint32_t index, uint32_t bad_block_valid, uint32_t bad_block_address)
{
    uint32_t obstat0_eft_spc = NVMC_OBSTAT0_EFT & NVMC_OBSTAT0_EFT_SPC;
    uint32_t otp_user_ctl0_spc_h = NVMC_OTP_USER_CTL0 & NVMC_OTP_USER_CTL0_SPC_H;
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_NVMC_BAD_BLOCK_INDEX(index)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x007BU), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_NVMC_BAD_BLOCK_VALID(bad_block_valid)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x007BU), ERR_PARAM_INVALID);
    } else if(NOT_NVMC_BAD_BLOCK_ADDR(bad_block_address)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x007BU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        /* check the option bytes security protection value */
        if((OB_HSPC == obstat0_eft_spc) || otp_user_ctl0_spc_h) {
            nvmc_ob_state = NVMC_HSPC;
        } else {
            /* wait for the nvmc ready */
            nvmc_ob_state = nvmc_ob_ready_wait(NVMC_TIMEOUT_COUNT);

            if(NVMC_OB_READY == nvmc_ob_state) {
                NVMC_OBBBADDRX_MDF(index) = (bad_block_valid << OBBBADDRX_OBBBADDRVLD_OFFSET) | (bad_block_address << OBBBADDRX_OBBBADDR_OFFSET);
                NVMC_OBCTL |= NVMC_OBCTL_OBSTART;

