RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_nvmc.c
    return itcm_kb_size;
}

/*!
    \brief      get ITCM size in ITCM/DTCM shared RAM (API_ID(0x0085U))
    \param[in]  none
    \param[out] none
    \retval     itcm size: ITCM size in KB unit
*/
uint32_t nvmc_ob_itcm_dtcm_shared_ram_itcm_size_get(void)
{
    uint32_t itcm_size_ob_value;
    uint32_t itcm_kb_size;

    itcm_size_ob_value = (uint32_t)((uint32_t)NVMC_OBSTAT1_EFT & NVMC_OBSTAT1_EFT_ITCM_DTCM_SHARED);

    switch(itcm_size_ob_value) {
    case OB_ITCM_DTCM_SHARED_ITCM_64KB:
        /* ITCM size is 64KB */
        itcm_kb_size = 64U;
        break;
    case OB_ITCM_DTCM_SHARED_ITCM_128KB:
        /* ITCM size is 128KB */
        itcm_kb_size = 128U;
        break;
    case OB_ITCM_DTCM_SHARED_ITCM_192KB:
        /* ITCM size is 192KB */
        itcm_kb_size = 192U;
        break;
    case OB_ITCM_DTCM_SHARED_ITCM_256KB:
        /* ITCM size is 256KB */
        itcm_kb_size = 256U;
        break;
    default:
        /* ITCM size is 0KB */
        itcm_kb_size = 0U;
        break;
    }

    return itcm_kb_size;
}

/*!
    \brief      get CNVM DCRP area configuration (API_ID(0x0086U))
    \param[in]  none
    \param[out] dcrp_erase_option: DCRP area erase option
    \param[out] dcrp_area_en: DCRP area enable option
    \param[out] dcrp_area_start_addr: DCRP area start address
    \param[out] dcrp_area_end_addr: DCRP area end address
    \retval     state of DCRP area address
      \arg        INVLD_ADDRESS_FLAG: the area address is invalid
      \arg        VLD_ADDRESS_FLAG: the area address is valid
*/
uint8_t nvmc_ob_cnvm_dcrp_area_get(uint32_t *dcrp_erase_option, uint32_t *dcrp_area_en, uint32_t *dcrp_area_start_addr, uint32_t *dcrp_area_end_addr)
{
    uint8_t address_stat = VLD_ADDRESS_FLAG;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(dcrp_erase_option)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0086U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(dcrp_area_en)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0086U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(dcrp_area_start_addr)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0086U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(dcrp_area_end_addr)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0086U), ERR_PARAM_POINTER);
    } else
#endif
    {
        uint32_t dcrpaddr_reg;
        dcrpaddr_reg = NVMC_DCRPADDR_EFT;
        *dcrp_erase_option = dcrpaddr_reg & NVMC_DCRPADDR_MDF_CNVM_DCRP_EREN;
        *dcrp_area_en = dcrpaddr_reg & NVMC_DCRPADDR_MDF_CNVM_DCRP_EN;

        *dcrp_area_start_addr = ((uint32_t)(dcrpaddr_reg & NVMC_DCRPADDR_EFT_DCRP_AREA_START)) >> DCRPADDR_DCRP_AREA_START_OFFSET;
        *dcrp_area_end_addr = ((uint32_t)(dcrpaddr_reg & NVMC_DCRPADDR_EFT_DCRP_AREA_END)) >> DCRPADDR_DCRP_AREA_END_OFFSET;

        if(*dcrp_area_en == 0U) {
            /* no valid DCRP area */
            address_stat = INVLD_ADDRESS_FLAG;
        } else {
            if((*dcrp_area_start_addr) == (*dcrp_area_end_addr)) {
                /* the whole CNVM memory is DCRP area */
                *dcrp_area_start_addr = CNVM_BASE_ADDRESS;
                *dcrp_area_end_addr = CNVM_BASE_ADDRESS + CNVM_SIZE - 1U;
                address_stat = VLD_ADDRESS_FLAG;
            } else if((*dcrp_area_start_addr) < (*dcrp_area_end_addr)) {
                /* get CNVM DCRP area start address */
                *dcrp_area_start_addr = (*dcrp_area_start_addr) * DCRP_SIZE_UNIT;
                *dcrp_area_start_addr += CNVM_BASE_ADDRESS;

                /* get CNVM DCRP area end address */
                *dcrp_area_end_addr = ((*dcrp_area_end_addr) + 1U) * DCRP_SIZE_UNIT - 1U;
                *dcrp_area_end_addr += CNVM_BASE_ADDRESS;
                address_stat = VLD_ADDRESS_FLAG;
            } else {
                /* no valid DCRP area */
                address_stat = INVLD_ADDRESS_FLAG;
            }
        }
    }
    return address_stat;
}

#ifndef NVM_VER_1_625_AND_0
/*!
    \brief      get ecnvm bank0 DCRP area configuration (API_ID(0x0087U))
    \param[in]  none
    \param[out] dcrp_erase_option: DCRP area erase option
    \param[out] dcrp_area_en: DCRP area enable option
    \param[out] dcrp_area_start_addr: DCRP area start address
    \param[out] dcrp_area_end_addr: DCRP area end address
    \retval     state of DCRP area address
      \arg        INVLD_ADDRESS_FLAG: the area address is invalid
      \arg        VLD_ADDRESS_FLAG: the area address is valid
*/
uint8_t nvmc_ob_ecnvm_bank0_dcrp_area_get(uint32_t *dcrp_erase_option, uint32_t *dcrp_area_en, uint32_t *dcrp_area_start_addr,
        uint32_t *dcrp_area_end_addr)
{
    uint8_t address_stat = VLD_ADDRESS_FLAG;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(dcrp_erase_option)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0087U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(dcrp_area_en)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0087U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(dcrp_area_start_addr)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0087U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(dcrp_area_end_addr)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0087U), ERR_PARAM_POINTER);
    } else
#endif
    {
        uint32_t dcrpaddr_reg;
        dcrpaddr_reg = NVMC_DCRPADDR_EFT;
        *dcrp_erase_option = dcrpaddr_reg & NVMC_DCRPADDR_MDF_ECNVM_BANK0_DCRP_EREN;
        *dcrp_area_en = dcrpaddr_reg & NVMC_DCRPADDR_MDF_ECNVM_BANK0_DCRP_EN;

        *dcrp_area_start_addr = ((uint32_t)(dcrpaddr_reg & NVMC_DCRPADDR_EFT_DCRP_AREA_START)) >> DCRPADDR_DCRP_AREA_START_OFFSET;
        *dcrp_area_end_addr = ((uint32_t)(dcrpaddr_reg & NVMC_DCRPADDR_EFT_DCRP_AREA_END)) >> DCRPADDR_DCRP_AREA_END_OFFSET;

        if(*dcrp_area_en == 0U) {
            /* no valid DCRP area */
            address_stat = INVLD_ADDRESS_FLAG;
        } else {
            if((*dcrp_area_start_addr) == (*dcrp_area_end_addr)) {
                /* the whole ecnvm bank0 memory is DCRP area */
                *dcrp_area_start_addr = MAIN_ECNVM_BANK0_BASE_ADDRESS;
                *dcrp_area_end_addr = MAIN_ECNVM_BANK0_BASE_ADDRESS + MAIN_ECNVM_BANK0_SIZE - 1U;
                address_stat = VLD_ADDRESS_FLAG;

            } else if((*dcrp_area_start_addr) < (*dcrp_area_end_addr)) {
                /* get ecnvm bank0 DCRP area start address */
                *dcrp_area_start_addr = (*dcrp_area_start_addr) * DCRP_SIZE_UNIT;
                *dcrp_area_start_addr += MAIN_ECNVM_BANK0_BASE_ADDRESS;

                /* get ecnvm bank0 DCRP area end address */
                *dcrp_area_end_addr = ((*dcrp_area_end_addr) + 1U) * DCRP_SIZE_UNIT - 1U;
                *dcrp_area_end_addr += MAIN_ECNVM_BANK0_BASE_ADDRESS;
                address_stat = VLD_ADDRESS_FLAG;
            } else {
                /* no valid DCRP area */
                address_stat = INVLD_ADDRESS_FLAG;
            }
        }
    }
    return address_stat;
}

