RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_nvmc.c
#ifndef NVM_VER_2_AND_3_5
/*!
    \brief      get ecnvm bank1 DCRP area configuration (API_ID(0x0088U))
    \param[in]  none
    \param[out] dcrp_erase_option: DCRP area erase option
    \param[out] dcrp_area_en: DCRP area enable option
    \param[out] dcrp_area_start_addr: DCRP area start address
    \param[out] dcrp_area_end_addr: DCRP area end address
    \retval     state of DCRP area address
      \arg        INVLD_ADDRESS_FLAG: the area address is invalid
      \arg        VLD_ADDRESS_FLAG: the area address is valid
*/
uint8_t nvmc_ob_ecnvm_bank1_dcrp_area_get(uint32_t *dcrp_erase_option, uint32_t *dcrp_area_en, uint32_t *dcrp_area_start_addr,
        uint32_t *dcrp_area_end_addr)
{
    uint8_t address_stat = VLD_ADDRESS_FLAG;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(dcrp_erase_option)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0088U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(dcrp_area_en)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0088U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(dcrp_area_start_addr)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0088U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(dcrp_area_end_addr)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0088U), ERR_PARAM_POINTER);
    } else
#endif
    {
        uint32_t dcrpaddr_reg;
        dcrpaddr_reg = NVMC_DCRPADDR_EFT;
        *dcrp_erase_option = dcrpaddr_reg & NVMC_DCRPADDR_MDF_ECNVM_BANK1_DCRP_EREN;
        *dcrp_area_en = dcrpaddr_reg & NVMC_DCRPADDR_MDF_ECNVM_BANK1_DCRP_EN;

        *dcrp_area_start_addr = ((uint32_t)(dcrpaddr_reg & NVMC_DCRPADDR_EFT_DCRP_AREA_START)) >> DCRPADDR_DCRP_AREA_START_OFFSET;
        *dcrp_area_end_addr = ((uint32_t)(dcrpaddr_reg & NVMC_DCRPADDR_EFT_DCRP_AREA_END)) >> DCRPADDR_DCRP_AREA_END_OFFSET;

        if(*dcrp_area_en == 0U) {
            /* no valid DCRP area */
            address_stat = INVLD_ADDRESS_FLAG;
        } else {
            if((*dcrp_area_start_addr) == (*dcrp_area_end_addr)) {
                /* the whole ecnvm bank1 memory is DCRP area */
                *dcrp_area_start_addr = MAIN_ECNVM_BANK1_BASE_ADDRESS;
                *dcrp_area_end_addr = MAIN_ECNVM_BANK1_BASE_ADDRESS + MAIN_ECNVM_BANK1_SIZE - 1U;
                address_stat = VLD_ADDRESS_FLAG;
            } else if((*dcrp_area_start_addr) < (*dcrp_area_end_addr)) {
                /* get ecnvm bank1 DCRP area start address */
                *dcrp_area_start_addr = (*dcrp_area_start_addr) * DCRP_SIZE_UNIT;
                *dcrp_area_start_addr += MAIN_ECNVM_BANK1_BASE_ADDRESS;

                /* get ecnvm bank1 DCRP area end address */
                *dcrp_area_end_addr = ((*dcrp_area_end_addr) + 1U) * DCRP_SIZE_UNIT - 1U;
                *dcrp_area_end_addr += MAIN_ECNVM_BANK1_BASE_ADDRESS;
                address_stat = VLD_ADDRESS_FLAG;
            } else {
                /* no valid DCRP area */
                address_stat = INVLD_ADDRESS_FLAG;
            }
        }
    }
    return address_stat;
}
#endif /* NVM_VER_2_AND_3_5 */
#endif /* NVM_VER_1_625_AND_0 */

/*!
    \brief      get CNVM secure area configuration (API_ID(0x0089U))
    \param[in]  none
    \param[out] secure_erase_option: secure area erase option
    \param[out] scr_area_en: secure area enable option
    \param[out] scr_area_start_addr: secure area start address
    \param[out] scr_area_end_addr: secure area end address
    \retval     state of secure area address
      \arg        INVLD_ADDRESS_FLAG: the area address is invalid
      \arg        VLD_ADDRESS_FLAG: the area address is valid
*/
uint8_t nvmc_ob_cnvm_secure_area_get(uint32_t *secure_erase_option, uint32_t *scr_area_en, uint32_t *scr_area_start_addr, uint32_t *scr_area_end_addr)
{
    uint8_t address_stat = VLD_ADDRESS_FLAG;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(secure_erase_option)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0089U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(scr_area_en)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0089U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(scr_area_start_addr)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0089U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(scr_area_end_addr)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0089U), ERR_PARAM_POINTER);
    } else
#endif
    {
        uint32_t scraddr_reg;
        scraddr_reg = NVMC_SCRADDR_EFT;
        *secure_erase_option = scraddr_reg & NVMC_SCRADDR_MDF_CNVM_SCR_EREN;
        *scr_area_en = scraddr_reg & NVMC_SCRADDR_MDF_CNVM_SCR_EN;

        *scr_area_start_addr = ((uint32_t)(scraddr_reg & NVMC_SCRADDR_EFT_SCR_AREA_START)) >> SCRADDR_SCR_AREA_START_OFFSET;
        *scr_area_end_addr = ((uint32_t)(scraddr_reg & NVMC_SCRADDR_EFT_SCR_AREA_END)) >> SCRADDR_SCR_AREA_END_OFFSET;

        if(*scr_area_en == 0U) {
            /* no valid secure area */
            address_stat = INVLD_ADDRESS_FLAG;
        } else {
            if((*scr_area_start_addr) == (*scr_area_end_addr)) {
                /* the whole CNVM memory is secure area */
                *scr_area_start_addr = CNVM_BASE_ADDRESS;
                *scr_area_end_addr = CNVM_BASE_ADDRESS + CNVM_SIZE - 1U;
                address_stat = VLD_ADDRESS_FLAG;
            } else if((*scr_area_start_addr) < (*scr_area_end_addr)) {
                /* get secure area start address */
                *scr_area_start_addr = (*scr_area_start_addr) * SCR_SIZE_UNIT;
                *scr_area_start_addr += CNVM_BASE_ADDRESS;

                /* get secure area end address */
                *scr_area_end_addr = ((*scr_area_end_addr) + 1U) * SCR_SIZE_UNIT - 1U;
                *scr_area_end_addr += CNVM_BASE_ADDRESS;
                address_stat = VLD_ADDRESS_FLAG;
            } else {
                /* no valid secure area */
                address_stat = INVLD_ADDRESS_FLAG;
            }
        }
    }
    return address_stat;
}

