RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_nvmc.c
#ifndef NVM_VER_1_625_AND_0
/*!
    \brief      get ecnvm bank0 secure area configuration (API_ID(0x008AU))
    \param[in]  none
    \param[out] secure_erase_option: secure area erase option
    \param[out] scr_area_en: secure area enable option
    \param[out] scr_area_start_addr: secure area start address
    \param[out] scr_area_end_addr: secure area end address
    \retval     state of secure area address
      \arg        INVLD_ADDRESS_FLAG: the area address is invalid
      \arg        VLD_ADDRESS_FLAG: the area address is valid
*/
uint8_t nvmc_ob_ecnvm_bank0_secure_area_get(uint32_t *secure_erase_option, uint32_t *scr_area_en, uint32_t *scr_area_start_addr,
        uint32_t *scr_area_end_addr)
{
    uint8_t address_stat = VLD_ADDRESS_FLAG;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(secure_erase_option)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x008AU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(scr_area_en)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x008AU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(scr_area_start_addr)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x008AU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(scr_area_end_addr)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x008AU), ERR_PARAM_POINTER);
    } else
#endif
    {
        uint32_t scraddr_reg;
        scraddr_reg = NVMC_SCRADDR_EFT;
        *secure_erase_option = scraddr_reg & NVMC_SCRADDR_MDF_ECNVM_BANK0_SCR_EREN;
        *scr_area_en = scraddr_reg & NVMC_SCRADDR_MDF_ECNVM_BANK1_SCR_EN;

        *scr_area_start_addr = ((uint32_t)(scraddr_reg & NVMC_SCRADDR_EFT_SCR_AREA_START)) >> SCRADDR_SCR_AREA_START_OFFSET;
        *scr_area_end_addr = ((uint32_t)(scraddr_reg & NVMC_SCRADDR_EFT_SCR_AREA_END)) >> SCRADDR_SCR_AREA_END_OFFSET;

        if(*scr_area_en == 0U) {
            /* no valid secure area */
            address_stat = INVLD_ADDRESS_FLAG;
        } else {
            if((*scr_area_start_addr) == (*scr_area_end_addr)) {
                /* the whole ecnvm bank0 memory is secure area */
                *scr_area_start_addr = MAIN_ECNVM_BANK0_BASE_ADDRESS;
                *scr_area_end_addr = MAIN_ECNVM_BANK0_BASE_ADDRESS + MAIN_ECNVM_BANK0_SIZE - 1U;
                address_stat = VLD_ADDRESS_FLAG;
            } else if((*scr_area_start_addr) < (*scr_area_end_addr)) {
                /* get secure area start address */
                *scr_area_start_addr = (*scr_area_start_addr) * SCR_SIZE_UNIT;
                *scr_area_start_addr += MAIN_ECNVM_BANK0_BASE_ADDRESS;

                /* get secure area end address */
                *scr_area_end_addr = ((*scr_area_end_addr) + 1U) * SCR_SIZE_UNIT - 1U;
                *scr_area_end_addr += MAIN_ECNVM_BANK0_BASE_ADDRESS;
                address_stat = VLD_ADDRESS_FLAG;
            } else {
                /* no valid secure area */
                address_stat = INVLD_ADDRESS_FLAG;
            }
        }
    }
    return address_stat;
}

#ifndef NVM_VER_2_AND_3_5
/*!
    \brief      get ecnvm bank1 secure area configuration (API_ID(0x008BU))
    \param[in]  none
    \param[out] secure_erase_option: secure area erase option
    \param[out] scr_area_en: secure area enable option
    \param[out] scr_area_start_addr: secure area start address
    \param[out] scr_area_end_addr: secure area end address
    \retval     state of secure area address
      \arg        INVLD_ADDRESS_FLAG: the area address is invalid
      \arg        VLD_ADDRESS_FLAG: the area address is valid
*/
uint8_t nvmc_ob_ecnvm_bank1_secure_area_get(uint32_t *secure_erase_option, uint32_t *scr_area_en, uint32_t *scr_area_start_addr,
        uint32_t *scr_area_end_addr)
{
    uint8_t address_stat = VLD_ADDRESS_FLAG;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(secure_erase_option)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x008BU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(scr_area_en)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x008BU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(scr_area_start_addr)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x008BU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(scr_area_end_addr)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x008BU), ERR_PARAM_POINTER);
    } else
#endif
    {
        uint32_t scraddr_reg;
        scraddr_reg = NVMC_SCRADDR_EFT;
        *secure_erase_option = scraddr_reg & NVMC_SCRADDR_MDF_ECNVM_BANK1_SCR_EREN;
        *scr_area_en = scraddr_reg & NVMC_SCRADDR_MDF_ECNVM_BANK1_SCR_EN;

        *scr_area_start_addr = ((uint32_t)(scraddr_reg & NVMC_SCRADDR_EFT_SCR_AREA_START)) >> SCRADDR_SCR_AREA_START_OFFSET;
        *scr_area_end_addr = ((uint32_t)(scraddr_reg & NVMC_SCRADDR_EFT_SCR_AREA_END)) >> SCRADDR_SCR_AREA_END_OFFSET;

        if(*scr_area_en == 0U) {
            /* no valid secure area */
            address_stat = INVLD_ADDRESS_FLAG;
        } else {
            if((*scr_area_start_addr) == (*scr_area_end_addr)) {
                /* the whole ecnvm bank1 memory is secure area */
                *scr_area_start_addr = MAIN_ECNVM_BANK1_BASE_ADDRESS;
                *scr_area_end_addr = MAIN_ECNVM_BANK1_BASE_ADDRESS + MAIN_ECNVM_BANK1_SIZE - 1U;
                address_stat = VLD_ADDRESS_FLAG;
            } else if((*scr_area_start_addr) < (*scr_area_end_addr)) {
                /* get secure area start address */
                *scr_area_start_addr = (*scr_area_start_addr) * SCR_SIZE_UNIT;
                *scr_area_start_addr += MAIN_ECNVM_BANK1_BASE_ADDRESS;

                /* get secure area end address */
                *scr_area_end_addr = ((*scr_area_end_addr) + 1U) * SCR_SIZE_UNIT - 1U;
                *scr_area_end_addr += MAIN_ECNVM_BANK1_BASE_ADDRESS;
                address_stat = VLD_ADDRESS_FLAG;
            } else {
                /* no valid secure area */
                address_stat = INVLD_ADDRESS_FLAG;
            }
        }
    }
    return address_stat;
}
#endif /* NVM_VER_2_AND_3_5 */
#endif /* NVM_VER_1_625_AND_0 */

/*!
    \brief      get option byte write protection (API_ID(0x008CU))
    \param[in]  wp_area: write protection area
                only one parameter can be selected which is shown as below:
      \arg        WP_AREA_ECNVM: main ecnvm write protection area (only in GD32H77XXW/GD32H78XXW, GD32H77XXP/GD32H78XXP, WP_AREA_ECNVM can be selected )
      \arg        WP_AREA_CNVM: CNVM write protection area (for GD32H77XXW/GD32H78XXW/GD32H77XXP/GD32H78XXP/GD32H77XXI/GD32H78XXI, WP_AREA_CNVM can be selected )
    \param[out] none
    \retval     the write protection option byte value(when wp_area = WP_AREA_ECNVM, GD32H77XXW/GD32H78XXW:0 - 0x0FFFFFFFFFFFFFFFU, GD32H77XXP/GD32H78XXP:0 - 0x000000000FFFFFFFU)
                (when wp_area = WP_AREA_CNVM, GD32H77XXW/GD32H78XXW and GD32H77XXP/GD32H78XXP:0 - 0x0000FFFFU, GD32H77XXI/GD32H78XXI:0 - 0x00001FFFU)
*/
uint64_t nvmc_ob_write_protection_get(wp_area_enum wp_area)
{
    uint64_t wp_cfg;

