RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_nvmc.c
#ifndef NVM_VER_1_625_AND_0
    /* return write protection option byte value */
    if(WP_AREA_ECNVM == wp_area) {
        /* ecnvm write protection */
        uint32_t temp = NVMC_WP0_ECNVM_EFT & NVMC_WP0_ECNVM_EFT_WP;
        wp_cfg = (uint64_t)temp;
#ifdef NVM_VER_2_AND_7_5
        uint32_t wp1_val = NVMC_WP1_ECNVM_EFT & NVMC_WP1_ECNVM_EFT_WP;
        wp_cfg |= (uint64_t)wp1_val << WP1_ECNVM_OFFSET;
#endif /* NVM_VER_2_AND_7_5 */
    } else
#endif /* NVM_VER_1_625_AND_0 */
    {
        if(WP_AREA_CNVM == wp_area) {
            /* CNVM write protection */
            wp_cfg = (uint64_t)(NVMC_WP_CNVM_EFT);
        } else {
            /* report error */
            wp_cfg = 0xFFFFFFFFFFFFFFFFU;
        }
    }
    return wp_cfg;
}

/*!
    \brief      get boot address (API_ID(0x008DU))
    \param[in]  none
    \param[out] boot_address_0: MSB of boot address 0
    \param[out] boot_address_1: MSB of boot address 1
    \retval     none
*/
void nvmc_ob_boot_address_get(uint32_t *boot_address_0, uint32_t *boot_address_1)
{
    uint32_t btaddr_reg;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(boot_address_0)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x008DU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(boot_address_1)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x008DU), ERR_PARAM_POINTER);
    } else
#endif
    {
        btaddr_reg = NVMC_BTADDR_EFT;
        *boot_address_0 = (uint32_t)((btaddr_reg & NVMC_BTADDR_EFT_BOOT_ADDR0) >> BTADDR_BOOT_ADDR0_OFFSET);
        *boot_address_1 = (uint32_t)((btaddr_reg & NVMC_BTADDR_EFT_BOOT_ADDR1) >> BTADDR_BOOT_ADDR1_OFFSET);
    }
}

/*!
    \brief      get option byte power-on reset self-check repair configuration (API_ID(0x008EU))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_power_on_self_check_get(void)
{
    FlagStatus flag = RESET;

    if(POR_RESET_REPAIR_ENABLE == (uint32_t)(NVMC_OBREPCTL_EFT & NVMC_OBREPCTL_EFT_PORRSTREPDIS)) {
        flag = SET;
    } else {
        flag = RESET;
    }
    return flag;
}

/*!
    \brief      get option byte system reset self-check repair configuration (API_ID(0x008FU))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_system_reset_check_get(void)
{
    FlagStatus flag = RESET;

    if(SYS_RESET_REPAIR_ENABLE == (uint32_t)(NVMC_OBREPCTL_EFT & NVMC_OBREPCTL_EFT_SYSRSTREPDIS)) {
        flag = SET;
    } else {
        flag = RESET;
    }
    return flag;
}

/*!
    \brief      get option byte bad data replacement in CNVM with ecnvm content (API_ID(0x0090U))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_cnvm_bad_data_replace_get(void)
{
    FlagStatus flag = RESET;

    if(BAD_CNVM_ADDR_REPLACE_ENABLE == (uint32_t)(NVMC_OBREPCTL_MDF & NVMC_OBREPCTL_MDF_BBREPLEN)) {
        flag = SET;
    } else {
        flag = RESET;
    }
    return flag;
}

/*!
    \brief      get option byte error repair unlock status during self check (API_ID(0x0091U))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_error_repair_unlock_get(void)
{
    FlagStatus flag = RESET;

    if(REPAIR_UNLOCK_ENABLE == (uint32_t)(NVMC_OBREPCTL_EFT & NVMC_OBREPCTL_EFT_REPUNLK)) {
        flag = SET;
    } else {
        flag = RESET;
    }
    return flag;
}

/*!
    \brief      get option byte data integrity enhancement mode (API_ID(0x0092U))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_data_integrity_enhance_mode_get(void)
{
    FlagStatus flag = RESET;

    if(OB_DATA_INTEGRITY_ENHANCE_MODE_ENABLE == (uint32_t)(NVMC_OBREPCTL_EFT & NVMC_OBREPCTL_EFT_DIEEN)) {
        flag = SET;
    } else {
        flag = RESET;
    }
    return flag;
}

/*!
    \brief      get option byte data integrity enhance area size in byte unit (API_ID(0x0093U))
    \param[in]  none
    \param[out] none
    \retval     data_integrity_enhance_area_size: data integrity enhance area size
*/
uint32_t nvmc_ob_data_integrity_enhance_area_size_get(void)
{
    uint32_t data_integrity_enhance_area_size = 0U;

    if(OB_DATA_INTEGRITY_ENHANCE_MODE_ENABLE == (uint32_t)(NVMC_OBREPCTL_EFT & NVMC_OBREPCTL_EFT_DIEEN)) {
        data_integrity_enhance_area_size = (((((uint32_t)(NVMC_OBREPCTL_EFT & NVMC_OBREPCTL_EFT_DIESZ)) >> OBREPCTL_DIESZ_OFFSET) + 1U) *
                                            DATA_INTEGRITY_ENHANCE_SIZE_UNIT);
    }
    return data_integrity_enhance_area_size;
}

/*!
    \brief      get option byte hardware self-check mode (API_ID(0x0094U))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_hardware_self_check_get(void)
{
    FlagStatus flag = RESET;

    if(OB_HW_SELF_CHECK_ENABLE == (uint32_t)(NVMC_OBREPCTL_MDF & NVMC_OBREPCTL_MDF_HWREPMOD)) {
        flag = SET;
    }

    return flag;
}

/*!
    \brief      get option byte repair address (API_ID(0x0095U))
    \param[in]  none
    \param[out] repair_start_addr: repair start address
    \param[out] repair_end_addr: repair end address
    \retval     state of repair address
      \arg        INVLD_ADDRESS_FLAG: the repair address is invalid
      \arg        VLD_ADDRESS_FLAG: the repair address is valid
*/
uint8_t nvmc_ob_repair_address_get(uint32_t *repair_start_addr, uint32_t *repair_end_addr)
{
    uint8_t address_stat = INVLD_ADDRESS_FLAG;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(repair_start_addr)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0095U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(repair_end_addr)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0095U), ERR_PARAM_POINTER);
    } else
#endif
    {
        *repair_start_addr = ((uint32_t)(NVMC_OBREPSTADDR_EFT & NVMC_OBREPSTADDR_EFT_STARTADDR)) >> OBREPSTADDR_STARTADDR_OFFSET;
        *repair_end_addr = ((uint32_t)(NVMC_OBREPENDADDR_MDF & NVMC_OBREPENDADDR_MDF_ENDADDR)) >> OBREPSTADDR_ENDADDR_OFFSET;

        if((*repair_start_addr) <= (*repair_end_addr)) {
            *repair_start_addr = CNVM_BASE_ADDRESS + (*repair_start_addr) * REPAIR_ADDRESS_UNIT;
            *repair_end_addr = CNVM_BASE_ADDRESS + (*repair_end_addr + 1U) * REPAIR_ADDRESS_UNIT - 1U;
            address_stat = VLD_ADDRESS_FLAG;
        } else {
            /* no valid repair area */
            address_stat = INVLD_ADDRESS_FLAG;
        }
    }
    return address_stat;
}

/*!
    \brief      get option byte bad block address (API_ID(0x0096U))
    \param[in]  index: number of bad block address (0 - 3)
    \param[out] bad_block_address: bad block address
    \retval     state of bad block address
      \arg        INVLD_ADDRESS_FLAG: the address is invalid
      \arg        VLD_ADDRESS_FLAG: the address is valid
*/
uint8_t nvmc_ob_bad_block_address_get(uint32_t index, uint32_t *bad_block_address)
{
    uint32_t bad_block_valid;
    uint8_t address_stat = INVLD_ADDRESS_FLAG;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_NVMC_BAD_BLOCK_INDEX(index)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0096U), ERR_PARAM_INVALID);
    } else if(NOT_VALID_POINTER(bad_block_address)) {
        fw_debug_report_err(NVMC_MODULE_ID, API_ID(0x0096U), ERR_PARAM_POINTER);
    } else
#endif
    {
        bad_block_valid = (NVMC_OBBBADDRX_EFT(index) & NVMC_OBBBADDRX_EFT_OBBBADDRVLD) >> OBBBADDRX_OBBBADDRVLD_OFFSET;
        if(bad_block_valid) {
            *bad_block_address = NVMC_OBBBADDRX_EFT(index) & (~NVMC_OBBBADDRX_EFT_OBBBADDRVLD);
            address_stat = VLD_ADDRESS_FLAG;
        } else {
            *bad_block_address = 0xFFFFFFFFU;
            /* no valid bad block address */
            address_stat = INVLD_ADDRESS_FLAG;
        }
    }
    return address_stat;
}

/*!
    \brief      get option byte flag set or reset (API_ID(0x0097U))
    \param[in]  ob_flag: check option byte flag
                only one parameter can be selected which is shown as below:
      \arg        NVMC_FLAG_OBMERR: option byte modified error flag bit
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_flag_get(uint32_t ob_flag)
{
    FlagStatus flag = RESET;

    if(NVMC_OBCTL & ob_flag) {
        flag = SET;
    }
    /* return the state of corresponding ecnvm flag */
    return flag;
}

/*!
    \brief      clear the option byte pending flag (API_ID(0x0098U))
    \param[in]  ob_flag: clear option byte flag
                only one parameter can be selected which is shown as below:
      \arg        NVMC_FLAG_OBMERR: option byte modified error flag bit
    \param[out] none
    \retval     none
*/
void nvmc_ob_flag_clear(uint32_t ob_flag)
{
    uint32_t reg_value;

    reg_value = NVMC_OBCTL;
    reg_value |= ob_flag;

    /* clear the flag */
    NVMC_OBCTL = reg_value;
}

/*!
    \brief      enable option byte interrupt (API_ID(0x0099U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_ob_interrupt_enable(void)
{
    NVMC_OBCTL |= NVMC_INT_OBMERRIE;
}

/*!
    \brief      disable option byte interrupt (API_ID(0x009AU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void nvmc_ob_interrupt_disable(void)
{
    NVMC_OBCTL &= ~(uint32_t)NVMC_INT_OBMERRIE;
}

/*!
    \brief      get option byte interrupt flag status (API_ID(0x009BU))
    \param[in]  ob_int_flag: option byte interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        NVMC_INT_FLAG_OBMERR: option byte modified error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus nvmc_ob_interrupt_flag_get(uint8_t ob_int_flag)
{
    FlagStatus reval = RESET;

    uint32_t reg1 = NVMC_OBCTL;
    uint32_t reg2 = NVMC_OBCTL;

