RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_nvmc.c
    switch(ob_int_flag) {
    /* option byte modified error interrupt */
    case NVMC_INT_FLAG_OBMERR:
        reg1 = reg1 & NVMC_FLAG_OBMERR;
        reg2 = reg2 & NVMC_INT_OBMERRIE;
        break;
    default :
        break;
    }
    /*get option byte interrupt flag status */
    if((0U != reg1) && (0U != reg2)) {
        reval = SET;
    }

    return reval;
}

/*!
    \brief      clear option byte interrupt flag status (API_ID(0x009CU))
    \param[in]  ob_int_flag: option byte interrupt flag status
                only one parameter can be selected which is shown as below:
      \arg        NVMC_INT_FLAG_OBMERR: option byte modified error interrupt flag
    \param[out] none
    \retval     none
*/
void nvmc_ob_interrupt_flag_clear(uint8_t ob_int_flag)
{

    switch(ob_int_flag) {
    /* option byte modified error interrupt */
    case NVMC_INT_FLAG_OBMERR:
        NVMC_OBCTL |= NVMC_FLAG_OBMERR;
        break;
    default :
        break;
    }
}

/*!
    \brief      get the option byte state (API_ID(0x009DU))
    \param[in]  none
    \param[out] none
    \retval     state of NVMC
      \arg        NVMC_OB_READY: option byte operation has been completed
      \arg        NVMC_OB_BUSY: option byte operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modify error
*/
static nvmc_ob_state_enum nvmc_ob_state_get(void)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_READY;

#ifndef NVM_VER_1_625_AND_0
    if(ECNVM_FLAG_BUSY == (NVMC_ECNVM_STAT & ECNVM_FLAG_BUSY)) {
        nvmc_ob_state = NVMC_OB_BUSY;
    }
#else
    if(CNVM_FLAG_BUSY == (NVMC_CNVM_STAT & CNVM_FLAG_BUSY)) {
        nvmc_ob_state = NVMC_OB_BUSY;
    }
#endif
    else if(RESET != (NVMC_OBCTL & NVMC_OBCTL_OBMERR)) {
        nvmc_ob_state = NVMC_OB_OBMERR;
    } else {
        nvmc_ob_state = NVMC_OB_READY;
    }

    /* return the NVMC state */
    return nvmc_ob_state;
}

/*!
    \brief      check whether option byte is ready or not (API_ID(0x009EU))
    \param[in]  timeout: timeout count (0x00000000 - 0xFFFFFFFF)
    \param[out] none
    \retval     state of option byte
      \arg        NVMC_OB_READY: option byte operation has been completed
      \arg        NVMC_OB_BUSY: option byte operation is in progress
      \arg        NVMC_OB_OBMERR: option byte modify error
      \arg        NVMC_OB_TOERR: option byte modified timeout error
    \note       This function contains scenarios leading to an infinite loop.
                Modify according to the user's actual usage scenarios.
*/
static nvmc_ob_state_enum nvmc_ob_ready_wait(uint32_t timeout)
{
    nvmc_ob_state_enum nvmc_ob_state = NVMC_OB_BUSY;

    /* wait for NVMC ready */
    do {
        /* get NVMC state */
        nvmc_ob_state = nvmc_ob_state_get();
        timeout--;
    } while((NVMC_OB_BUSY == nvmc_ob_state) && (0U != timeout));

    if(NVMC_OB_BUSY == nvmc_ob_state) {
        nvmc_ob_state = NVMC_OB_TOERR;
    }
    /* return the NVMC state */
    return nvmc_ob_state;
}
